{
  "<pad>": 0,
  "<unk>": 1,
  "<bos>": 2,
  "<eos>": 3,
  "<mask>": 4,
  "<newline>": 5,
  "<indent>": 6,
  "<dedent>": 7,
  "$": 10,
  "@": 93,
  "%": 64,
  "&": 13,
  "if": 20,
  "elif": 21,
  "else": 22,
  "while": 23,
  "for": 24,
  "in": 45,
  "def": 26,
  "return": 27,
  "lambda": 28,
  "class": 29,
  "self": 30,
  "try": 31,
  "except": 32,
  "finally": 33,
  "raise": 34,
  "import": 35,
  "from": 36,
  "as": 37,
  "True": 38,
  "False": 39,
  "None": 40,
  "and": 41,
  "or": 42,
  "not": 43,
  "is": 44,
  "break": 46,
  "continue": 47,
  "pass": 48,
  "with": 49,
  "yield": 50,
  "global": 51,
  "nonlocal": 52,
  "assert": 53,
  "del": 54,
  "+": 60,
  "-": 61,
  "*": 62,
  "/": 63,
  "**": 65,
  "//": 66,
  "==": 67,
  "!=": 68,
  "<": 69,
  ">": 70,
  "<=": 71,
  ">=": 72,
  "=": 73,
  "+=": 74,
  "-=": 75,
  "*=": 76,
  "/=": 77,
  "->": 78,
  "=>": 79,
  "(": 80,
  ")": 81,
  "[": 82,
  "]": 83,
  "{": 84,
  "}": 85,
  ",": 86,
  ":": 87,
  ".": 88,
  ";": 89,
  "\"": 90,
  "'": 91,
  "#": 92,
  "print": 100,
  "len": 101,
  "range": 102,
  "str": 103,
  "int": 104,
  "float": 105,
  "bool": 106,
  "list": 107,
  "dict": 108,
  "set": 109,
  "tuple": 110,
  "type": 111,
  "isinstance": 112,
  "abs": 113,
  "round": 114,
  "min": 115,
  "max": 116,
  "sum": 117,
  "sorted": 118,
  "reversed": 119,
  "enumerate": 120,
  "zip": 121,
  "map": 122,
  "filter": 123,
  "upper": 124,
  "lower": 125,
  "strip": 126,
  "split": 127,
  "join": 128,
  "replace": 129,
  "find": 130,
  "format": 131,
  "append": 132,
  "extend": 133,
  "insert": 134,
  "remove": 135,
  "pop": 136,
  "keys": 137,
  "values": 138,
  "items": 139,
  "get": 140,
  "open": 141,
  "input": 142,
  "http_get": 143,
  "http_post": 144,
  "json_parse": 145,
  "json_stringify": 146,
  "re_match": 147,
  "re_search": 148,
  "re_findall": 149,
  "re_sub": 150,
  "name": 200,
  "value": 201,
  "result": 202,
  "data": 203,
  "item": 204,
  "key": 205,
  "index": 206,
  "count": 207,
  "x": 208,
  "y": 209,
  "z": 210,
  "i": 211,
  "j": 212,
  "k": 213,
  "n": 214,
  "m": 215,
  "arr": 216,
  "hash": 217,
  "func": 218,
  "callback": 219,
  "handler": 220,
  "start": 221,
  "end": 222,
  "step": 223,
  "size": 224,
  "length": 225,
  "first": 226,
  "last": 227,
  "next": 228,
  "prev": 229,
  "left": 230,
  "right": 231,
  "mid": 232,
  "pivot": 233,
  "total": 234,
  "avg": 235,
  "error": 236,
  "message": 237,
  "status": 238,
  "response": 239,
  "config": 240,
  "options": 241,
  "params": 242,
  "args": 243,
  "hello": 244,
  "world": 245,
  "test": 246,
  "example": 247,
  "main": 248,
  "init": 249,
  "run": 250,
  "execute": 251,
  "process": 252,
  "file": 253,
  "path": 254,
  "dir": 255,
  "line": 256,
  "column": 257,
  "token": 258,
  "node": 259,
  "ast": 260,
  "0": 1000,
  "1": 1001,
  "2": 1002,
  "3": 1003,
  "4": 1004,
  "5": 1005,
  "6": 1006,
  "7": 1007,
  "8": 1008,
  "9": 1009,
  "10": 1010,
  "11": 1011,
  "12": 1012,
  "13": 1013,
  "14": 1014,
  "15": 1015,
  "16": 1016,
  "17": 1017,
  "18": 1018,
  "19": 1019,
  "20": 1020,
  "21": 1021,
  "22": 1022,
  "23": 1023,
  "24": 1024,
  "25": 1025,
  "26": 1026,
  "27": 1027,
  "28": 1028,
  "29": 1029,
  "30": 1030,
  "31": 1031,
  "32": 1032,
  "33": 1033,
  "34": 1034,
  "35": 1035,
  "36": 1036,
  "37": 1037,
  "38": 1038,
  "39": 1039,
  "40": 1040,
  "41": 1041,
  "42": 1042,
  "43": 1043,
  "44": 1044,
  "45": 1045,
  "46": 1046,
  "47": 1047,
  "48": 1048,
  "49": 1049,
  "50": 1050,
  "51": 1051,
  "52": 1052,
  "53": 1053,
  "54": 1054,
  "55": 1055,
  "56": 1056,
  "57": 1057,
  "58": 1058,
  "59": 1059,
  "60": 1060,
  "61": 1061,
  "62": 1062,
  "63": 1063,
  "64": 1064,
  "65": 1065,
  "66": 1066,
  "67": 1067,
  "68": 1068,
  "69": 1069,
  "70": 1070,
  "71": 1071,
  "72": 1072,
  "73": 1073,
  "74": 1074,
  "75": 1075,
  "76": 1076,
  "77": 1077,
  "78": 1078,
  "79": 1079,
  "80": 1080,
  "81": 1081,
  "82": 1082,
  "83": 1083,
  "84": 1084,
  "85": 1085,
  "86": 1086,
  "87": 1087,
  "88": 1088,
  "89": 1089,
  "90": 1090,
  "91": 1091,
  "92": 1092,
  "93": 1093,
  "94": 1094,
  "95": 1095,
  "96": 1096,
  "97": 1097,
  "98": 1098,
  "99": 1099,
  "100": 1100,
  "101": 1101,
  "102": 1102,
  "103": 1103,
  "104": 1104,
  "105": 1105,
  "106": 1106,
  "107": 1107,
  "108": 1108,
  "109": 1109,
  "110": 1110,
  "111": 1111,
  "112": 1112,
  "113": 1113,
  "114": 1114,
  "115": 1115,
  "116": 1116,
  "117": 1117,
  "118": 1118,
  "119": 1119,
  "120": 1120,
  "121": 1121,
  "122": 1122,
  "123": 1123,
  "124": 1124,
  "125": 1125,
  "126": 1126,
  "127": 1127,
  "128": 1128,
  "129": 1129,
  "130": 1130,
  "131": 1131,
  "132": 1132,
  "133": 1133,
  "134": 1134,
  "135": 1135,
  "136": 1136,
  "137": 1137,
  "138": 1138,
  "139": 1139,
  "140": 1140,
  "141": 1141,
  "142": 1142,
  "143": 1143,
  "144": 1144,
  "145": 1145,
  "146": 1146,
  "147": 1147,
  "148": 1148,
  "149": 1149,
  "150": 1150,
  "151": 1151,
  "152": 1152,
  "153": 1153,
  "154": 1154,
  "155": 1155,
  "156": 1156,
  "157": 1157,
  "158": 1158,
  "159": 1159,
  "160": 1160,
  "161": 1161,
  "162": 1162,
  "163": 1163,
  "164": 1164,
  "165": 1165,
  "166": 1166,
  "167": 1167,
  "168": 1168,
  "169": 1169,
  "170": 1170,
  "171": 1171,
  "172": 1172,
  "173": 1173,
  "174": 1174,
  "175": 1175,
  "176": 1176,
  "177": 1177,
  "178": 1178,
  "179": 1179,
  "180": 1180,
  "181": 1181,
  "182": 1182,
  "183": 1183,
  "184": 1184,
  "185": 1185,
  "186": 1186,
  "187": 1187,
  "188": 1188,
  "189": 1189,
  "190": 1190,
  "191": 1191,
  "192": 1192,
  "193": 1193,
  "194": 1194,
  "195": 1195,
  "196": 1196,
  "197": 1197,
  "198": 1198,
  "199": 1199,
  "200": 1200,
  "201": 1201,
  "202": 1202,
  "203": 1203,
  "204": 1204,
  "205": 1205,
  "206": 1206,
  "207": 1207,
  "208": 1208,
  "209": 1209,
  "210": 1210,
  "211": 1211,
  "212": 1212,
  "213": 1213,
  "214": 1214,
  "215": 1215,
  "216": 1216,
  "217": 1217,
  "218": 1218,
  "219": 1219,
  "220": 1220,
  "221": 1221,
  "222": 1222,
  "223": 1223,
  "224": 1224,
  "225": 1225,
  "226": 1226,
  "227": 1227,
  "228": 1228,
  "229": 1229,
  "230": 1230,
  "231": 1231,
  "232": 1232,
  "233": 1233,
  "234": 1234,
  "235": 1235,
  "236": 1236,
  "237": 1237,
  "238": 1238,
  "239": 1239,
  "240": 1240,
  "241": 1241,
  "242": 1242,
  "243": 1243,
  "244": 1244,
  "245": 1245,
  "246": 1246,
  "247": 1247,
  "248": 1248,
  "249": 1249,
  "250": 1250,
  "251": 1251,
  "252": 1252,
  "253": 1253,
  "254": 1254,
  "255": 1255,
  "256": 1256,
  "257": 1257,
  "258": 1258,
  "259": 1259,
  "260": 1260,
  "261": 1261,
  "262": 1262,
  "263": 1263,
  "264": 1264,
  "265": 1265,
  "266": 1266,
  "267": 1267,
  "268": 1268,
  "269": 1269,
  "270": 1270,
  "271": 1271,
  "272": 1272,
  "273": 1273,
  "274": 1274,
  "275": 1275,
  "276": 1276,
  "277": 1277,
  "278": 1278,
  "279": 1279,
  "280": 1280,
  "281": 1281,
  "282": 1282,
  "283": 1283,
  "284": 1284,
  "285": 1285,
  "286": 1286,
  "287": 1287,
  "288": 1288,
  "289": 1289,
  "290": 1290,
  "291": 1291,
  "292": 1292,
  "293": 1293,
  "294": 1294,
  "295": 1295,
  "296": 1296,
  "297": 1297,
  "298": 1298,
  "299": 1299,
  "300": 1300,
  "301": 1301,
  "302": 1302,
  "303": 1303,
  "304": 1304,
  "305": 1305,
  "306": 1306,
  "307": 1307,
  "308": 1308,
  "309": 1309,
  "310": 1310,
  "311": 1311,
  "312": 1312,
  "313": 1313,
  "314": 1314,
  "315": 1315,
  "316": 1316,
  "317": 1317,
  "318": 1318,
  "319": 1319,
  "320": 1320,
  "321": 1321,
  "322": 1322,
  "323": 1323,
  "324": 1324,
  "325": 1325,
  "326": 1326,
  "327": 1327,
  "328": 1328,
  "329": 1329,
  "330": 1330,
  "331": 1331,
  "332": 1332,
  "333": 1333,
  "334": 1334,
  "335": 1335,
  "336": 1336,
  "337": 1337,
  "338": 1338,
  "339": 1339,
  "340": 1340,
  "341": 1341,
  "342": 1342,
  "343": 1343,
  "344": 1344,
  "345": 1345,
  "346": 1346,
  "347": 1347,
  "348": 1348,
  "349": 1349,
  "350": 1350,
  "351": 1351,
  "352": 1352,
  "353": 1353,
  "354": 1354,
  "355": 1355,
  "356": 1356,
  "357": 1357,
  "358": 1358,
  "359": 1359,
  "360": 1360,
  "361": 1361,
  "362": 1362,
  "363": 1363,
  "364": 1364,
  "365": 1365,
  "366": 1366,
  "367": 1367,
  "368": 1368,
  "369": 1369,
  "370": 1370,
  "371": 1371,
  "372": 1372,
  "373": 1373,
  "374": 1374,
  "375": 1375,
  "376": 1376,
  "377": 1377,
  "378": 1378,
  "379": 1379,
  "380": 1380,
  "381": 1381,
  "382": 1382,
  "383": 1383,
  "384": 1384,
  "385": 1385,
  "386": 1386,
  "387": 1387,
  "388": 1388,
  "389": 1389,
  "390": 1390,
  "391": 1391,
  "392": 1392,
  "393": 1393,
  "394": 1394,
  "395": 1395,
  "396": 1396,
  "397": 1397,
  "398": 1398,
  "399": 1399,
  "400": 1400,
  "401": 1401,
  "402": 1402,
  "403": 1403,
  "404": 1404,
  "405": 1405,
  "406": 1406,
  "407": 1407,
  "408": 1408,
  "409": 1409,
  "410": 1410,
  "411": 1411,
  "412": 1412,
  "413": 1413,
  "414": 1414,
  "415": 1415,
  "416": 1416,
  "417": 1417,
  "418": 1418,
  "419": 1419,
  "420": 1420,
  "421": 1421,
  "422": 1422,
  "423": 1423,
  "424": 1424,
  "425": 1425,
  "426": 1426,
  "427": 1427,
  "428": 1428,
  "429": 1429,
  "430": 1430,
  "431": 1431,
  "432": 1432,
  "433": 1433,
  "434": 1434,
  "435": 1435,
  "436": 1436,
  "437": 1437,
  "438": 1438,
  "439": 1439,
  "440": 1440,
  "441": 1441,
  "442": 1442,
  "443": 1443,
  "444": 1444,
  "445": 1445,
  "446": 1446,
  "447": 1447,
  "448": 1448,
  "449": 1449,
  "450": 1450,
  "451": 1451,
  "452": 1452,
  "453": 1453,
  "454": 1454,
  "455": 1455,
  "456": 1456,
  "457": 1457,
  "458": 1458,
  "459": 1459,
  "460": 1460,
  "461": 1461,
  "462": 1462,
  "463": 1463,
  "464": 1464,
  "465": 1465,
  "466": 1466,
  "467": 1467,
  "468": 1468,
  "469": 1469,
  "470": 1470,
  "471": 1471,
  "472": 1472,
  "473": 1473,
  "474": 1474,
  "475": 1475,
  "476": 1476,
  "477": 1477,
  "478": 1478,
  "479": 1479,
  "480": 1480,
  "481": 1481,
  "482": 1482,
  "483": 1483,
  "484": 1484,
  "485": 1485,
  "486": 1486,
  "487": 1487,
  "488": 1488,
  "489": 1489,
  "490": 1490,
  "491": 1491,
  "492": 1492,
  "493": 1493,
  "494": 1494,
  "495": 1495,
  "496": 1496,
  "497": 1497,
  "498": 1498,
  "499": 1499,
  "500": 1500,
  "501": 1501,
  "502": 1502,
  "503": 1503,
  "504": 1504,
  "505": 1505,
  "506": 1506,
  "507": 1507,
  "508": 1508,
  "509": 1509,
  "510": 1510,
  "511": 1511,
  "512": 1512,
  "513": 1513,
  "514": 1514,
  "515": 1515,
  "516": 1516,
  "517": 1517,
  "518": 1518,
  "519": 1519,
  "520": 1520,
  "521": 1521,
  "522": 1522,
  "523": 1523,
  "524": 1524,
  "525": 1525,
  "526": 1526,
  "527": 1527,
  "528": 1528,
  "529": 1529,
  "530": 1530,
  "531": 1531,
  "532": 1532,
  "533": 1533,
  "534": 1534,
  "535": 1535,
  "536": 1536,
  "537": 1537,
  "538": 1538,
  "539": 1539,
  "540": 1540,
  "541": 1541,
  "542": 1542,
  "543": 1543,
  "544": 1544,
  "545": 1545,
  "546": 1546,
  "547": 1547,
  "548": 1548,
  "549": 1549,
  "550": 1550,
  "551": 1551,
  "552": 1552,
  "553": 1553,
  "554": 1554,
  "555": 1555,
  "556": 1556,
  "557": 1557,
  "558": 1558,
  "559": 1559,
  "560": 1560,
  "561": 1561,
  "562": 1562,
  "563": 1563,
  "564": 1564,
  "565": 1565,
  "566": 1566,
  "567": 1567,
  "568": 1568,
  "569": 1569,
  "570": 1570,
  "571": 1571,
  "572": 1572,
  "573": 1573,
  "574": 1574,
  "575": 1575,
  "576": 1576,
  "577": 1577,
  "578": 1578,
  "579": 1579,
  "580": 1580,
  "581": 1581,
  "582": 1582,
  "583": 1583,
  "584": 1584,
  "585": 1585,
  "586": 1586,
  "587": 1587,
  "588": 1588,
  "589": 1589,
  "590": 1590,
  "591": 1591,
  "592": 1592,
  "593": 1593,
  "594": 1594,
  "595": 1595,
  "596": 1596,
  "597": 1597,
  "598": 1598,
  "599": 1599,
  "600": 1600,
  "601": 1601,
  "602": 1602,
  "603": 1603,
  "604": 1604,
  "605": 1605,
  "606": 1606,
  "607": 1607,
  "608": 1608,
  "609": 1609,
  "610": 1610,
  "611": 1611,
  "612": 1612,
  "613": 1613,
  "614": 1614,
  "615": 1615,
  "616": 1616,
  "617": 1617,
  "618": 1618,
  "619": 1619,
  "620": 1620,
  "621": 1621,
  "622": 1622,
  "623": 1623,
  "624": 1624,
  "625": 1625,
  "626": 1626,
  "627": 1627,
  "628": 1628,
  "629": 1629,
  "630": 1630,
  "631": 1631,
  "632": 1632,
  "633": 1633,
  "634": 1634,
  "635": 1635,
  "636": 1636,
  "637": 1637,
  "638": 1638,
  "639": 1639,
  "640": 1640,
  "641": 1641,
  "642": 1642,
  "643": 1643,
  "644": 1644,
  "645": 1645,
  "646": 1646,
  "647": 1647,
  "648": 1648,
  "649": 1649,
  "650": 1650,
  "651": 1651,
  "652": 1652,
  "653": 1653,
  "654": 1654,
  "655": 1655,
  "656": 1656,
  "657": 1657,
  "658": 1658,
  "659": 1659,
  "660": 1660,
  "661": 1661,
  "662": 1662,
  "663": 1663,
  "664": 1664,
  "665": 1665,
  "666": 1666,
  "667": 1667,
  "668": 1668,
  "669": 1669,
  "670": 1670,
  "671": 1671,
  "672": 1672,
  "673": 1673,
  "674": 1674,
  "675": 1675,
  "676": 1676,
  "677": 1677,
  "678": 1678,
  "679": 1679,
  "680": 1680,
  "681": 1681,
  "682": 1682,
  "683": 1683,
  "684": 1684,
  "685": 1685,
  "686": 1686,
  "687": 1687,
  "688": 1688,
  "689": 1689,
  "690": 1690,
  "691": 1691,
  "692": 1692,
  "693": 1693,
  "694": 1694,
  "695": 1695,
  "696": 1696,
  "697": 1697,
  "698": 1698,
  "699": 1699,
  "700": 1700,
  "701": 1701,
  "702": 1702,
  "703": 1703,
  "704": 1704,
  "705": 1705,
  "706": 1706,
  "707": 1707,
  "708": 1708,
  "709": 1709,
  "710": 1710,
  "711": 1711,
  "712": 1712,
  "713": 1713,
  "714": 1714,
  "715": 1715,
  "716": 1716,
  "717": 1717,
  "718": 1718,
  "719": 1719,
  "720": 1720,
  "721": 1721,
  "722": 1722,
  "723": 1723,
  "724": 1724,
  "725": 1725,
  "726": 1726,
  "727": 1727,
  "728": 1728,
  "729": 1729,
  "730": 1730,
  "731": 1731,
  "732": 1732,
  "733": 1733,
  "734": 1734,
  "735": 1735,
  "736": 1736,
  "737": 1737,
  "738": 1738,
  "739": 1739,
  "740": 1740,
  "741": 1741,
  "742": 1742,
  "743": 1743,
  "744": 1744,
  "745": 1745,
  "746": 1746,
  "747": 1747,
  "748": 1748,
  "749": 1749,
  "750": 1750,
  "751": 1751,
  "752": 1752,
  "753": 1753,
  "754": 1754,
  "755": 1755,
  "756": 1756,
  "757": 1757,
  "758": 1758,
  "759": 1759,
  "760": 1760,
  "761": 1761,
  "762": 1762,
  "763": 1763,
  "764": 1764,
  "765": 1765,
  "766": 1766,
  "767": 1767,
  "768": 1768,
  "769": 1769,
  "770": 1770,
  "771": 1771,
  "772": 1772,
  "773": 1773,
  "774": 1774,
  "775": 1775,
  "776": 1776,
  "777": 1777,
  "778": 1778,
  "779": 1779,
  "780": 1780,
  "781": 1781,
  "782": 1782,
  "783": 1783,
  "784": 1784,
  "785": 1785,
  "786": 1786,
  "787": 1787,
  "788": 1788,
  "789": 1789,
  "790": 1790,
  "791": 1791,
  "792": 1792,
  "793": 1793,
  "794": 1794,
  "795": 1795,
  "796": 1796,
  "797": 1797,
  "798": 1798,
  "799": 1799,
  "800": 1800,
  "801": 1801,
  "802": 1802,
  "803": 1803,
  "804": 1804,
  "805": 1805,
  "806": 1806,
  "807": 1807,
  "808": 1808,
  "809": 1809,
  "810": 1810,
  "811": 1811,
  "812": 1812,
  "813": 1813,
  "814": 1814,
  "815": 1815,
  "816": 1816,
  "817": 1817,
  "818": 1818,
  "819": 1819,
  "820": 1820,
  "821": 1821,
  "822": 1822,
  "823": 1823,
  "824": 1824,
  "825": 1825,
  "826": 1826,
  "827": 1827,
  "828": 1828,
  "829": 1829,
  "830": 1830,
  "831": 1831,
  "832": 1832,
  "833": 1833,
  "834": 1834,
  "835": 1835,
  "836": 1836,
  "837": 1837,
  "838": 1838,
  "839": 1839,
  "840": 1840,
  "841": 1841,
  "842": 1842,
  "843": 1843,
  "844": 1844,
  "845": 1845,
  "846": 1846,
  "847": 1847,
  "848": 1848,
  "849": 1849,
  "850": 1850,
  "851": 1851,
  "852": 1852,
  "853": 1853,
  "854": 1854,
  "855": 1855,
  "856": 1856,
  "857": 1857,
  "858": 1858,
  "859": 1859,
  "860": 1860,
  "861": 1861,
  "862": 1862,
  "863": 1863,
  "864": 1864,
  "865": 1865,
  "866": 1866,
  "867": 1867,
  "868": 1868,
  "869": 1869,
  "870": 1870,
  "871": 1871,
  "872": 1872,
  "873": 1873,
  "874": 1874,
  "875": 1875,
  "876": 1876,
  "877": 1877,
  "878": 1878,
  "879": 1879,
  "880": 1880,
  "881": 1881,
  "882": 1882,
  "883": 1883,
  "884": 1884,
  "885": 1885,
  "886": 1886,
  "887": 1887,
  "888": 1888,
  "889": 1889,
  "890": 1890,
  "891": 1891,
  "892": 1892,
  "893": 1893,
  "894": 1894,
  "895": 1895,
  "896": 1896,
  "897": 1897,
  "898": 1898,
  "899": 1899,
  "900": 1900,
  "901": 1901,
  "902": 1902,
  "903": 1903,
  "904": 1904,
  "905": 1905,
  "906": 1906,
  "907": 1907,
  "908": 1908,
  "909": 1909,
  "910": 1910,
  "911": 1911,
  "912": 1912,
  "913": 1913,
  "914": 1914,
  "915": 1915,
  "916": 1916,
  "917": 1917,
  "918": 1918,
  "919": 1919,
  "920": 1920,
  "921": 1921,
  "922": 1922,
  "923": 1923,
  "924": 1924,
  "925": 1925,
  "926": 1926,
  "927": 1927,
  "928": 1928,
  "929": 1929,
  "930": 1930,
  "931": 1931,
  "932": 1932,
  "933": 1933,
  "934": 1934,
  "935": 1935,
  "936": 1936,
  "937": 1937,
  "938": 1938,
  "939": 1939,
  "940": 1940,
  "941": 1941,
  "942": 1942,
  "943": 1943,
  "944": 1944,
  "945": 1945,
  "946": 1946,
  "947": 1947,
  "948": 1948,
  "949": 1949,
  "950": 1950,
  "951": 1951,
  "952": 1952,
  "953": 1953,
  "954": 1954,
  "955": 1955,
  "956": 1956,
  "957": 1957,
  "958": 1958,
  "959": 1959,
  "960": 1960,
  "961": 1961,
  "962": 1962,
  "963": 1963,
  "964": 1964,
  "965": 1965,
  "966": 1966,
  "967": 1967,
  "968": 1968,
  "969": 1969,
  "970": 1970,
  "971": 1971,
  "972": 1972,
  "973": 1973,
  "974": 1974,
  "975": 1975,
  "976": 1976,
  "977": 1977,
  "978": 1978,
  "979": 1979,
  "980": 1980,
  "981": 1981,
  "982": 1982,
  "983": 1983,
  "984": 1984,
  "985": 1985,
  "986": 1986,
  "987": 1987,
  "988": 1988,
  "989": 1989,
  "990": 1990,
  "991": 1991,
  "992": 1992,
  "993": 1993,
  "994": 1994,
  "995": 1995,
  "996": 1996,
  "997": 1997,
  "998": 1998,
  "999": 1999,
  "1000": 2000,
  "\"Hello, World!\"": 1191,
  "\"World\"": 1192,
  "\"Hello, \"": 1193,
  "\"!\"": 1194,
  "greet": 1195,
  "\"Alice\"": 1196,
  "names": 1197,
  "\"Bob\"": 1198,
  "\"Charlie\"": 1199,
  "greeting": 1200,
  "\"Hello\"": 1201,
  "target": 1202,
  "\", \"": 1203,
  "\"\"": 1204,
  "\"Hello,": 1205,
  "World": 1206,
  "Multi": 1207,
  "times": 1208,
  "person": 1209,
  "\"greeting\"": 1210,
  "\"name\"": 1211,
  "uppercase": 1212,
  "\"hello, world!\"": 1213,
  "lowercase": 1214,
  "\"HELLO, WORLD!\"": 1215,
  "chars": 1216,
  "joined": 1217,
  "\"-\"": 1218,
  "repeated": 1219,
  "\"Hello \"": 1220,
  "substring": 1221,
  "found": 1222,
  "replaced": 1223,
  "\"Pyrl\"": 1224,
  "starts": 1225,
  "startswith": 1226,
  "ends": 1227,
  "endswith": 1228,
  "stripped": 1229,
  "\"  Hello, World!  \"": 1230,
  "words": 1231,
  "\"Hello World from Pyrl\"": 1232,
  "\" \"": 1233,
  "formatted": 1234,
  "\"Hello, {}!\"": 1235,
  "char": 1236,
  "reversed_str": 1237,
  "ascii": 1238,
  "ord": 1239,
  "\"A\"": 1240,
  "char_from_ascii": 1241,
  "chr": 1242,
  "is_alpha": 1243,
  "isalpha": 1244,
  "is_digit": 1245,
  "\"123\"": 1246,
  "isdigit": 1247,
  "capitalized": 1248,
  "\"hello\"": 1249,
  "capitalize": 1250,
  "title_case": 1251,
  "\"hello world\"": 1252,
  "title": 1253,
  "count_hello": 1254,
  "\"Hello Hello Hello\"": 1255,
  "centered": 1256,
  "center": 1257,
  "left_just": 1258,
  "ljust": 1259,
  "right_just": 1260,
  "rjust": 1261,
  "zero_filled": 1262,
  "\"42\"": 1263,
  "zfill": 1264,
  "is_alnum": 1265,
  "\"Hello123\"": 1266,
  "isalnum": 1267,
  "is_space": 1268,
  "\"   \"": 1269,
  "isspace": 1270,
  "is_lower": 1271,
  "islower": 1272,
  "is_upper": 1273,
  "\"HELLO\"": 1274,
  "isupper": 1275,
  "is_title": 1276,
  "\"Hello World\"": 1277,
  "istitle": 1278,
  "swap_case": 1279,
  "\"HeLLo WoRLD\"": 1280,
  "swapcase": 1281,
  "partition_result": 1282,
  "partition": 1283,
  "rpartition_result": 1284,
  "rpartition": 1285,
  "splitlines_result": 1286,
  "\"Line1\\nLine2\\nLine3\"": 1287,
  "splitlines": 1288,
  "lstripped": 1289,
  "\"   Hello   \"": 1290,
  "lstrip": 1291,
  "rstripped": 1292,
  "rstrip": 1293,
  "is_numeric": 1294,
  "\"123.45\"": 1295,
  "isnumeric": 1296,
  "is_decimal": 1297,
  "isdecimal": 1298,
  "int_var": 1299,
  "float_var": 1300,
  "3.14159": 1301,
  "str_var": 1302,
  "\"Hello, Pyrl!\"": 1303,
  "bool_var": 1304,
  "none_var": 1305,
  "array_var": 1306,
  "hash_var": 1307,
  "age": 1308,
  "3.9": 1309,
  "\"3.14\"": 1310,
  "hex_num": 1311,
  "xFF": 1312,
  "bin_num": 1313,
  "b1010": 1314,
  "sci_num": 1315,
  "1.5": 1316,
  "e10": 1317,
  "neg_num": 1318,
  "big_num": 1319,
  "12345678901234567890": 1320,
  "inf_val": 1321,
  "INF": 1322,
  "nan_val": 1323,
  "NAN": 1324,
  "pi_val": 1325,
  "PI": 1326,
  "e_val": 1327,
  "E": 1328,
  "a": 1329,
  "b": 1330,
  "c": 1331,
  "temp": 1332,
  "test_scope": 1333,
  "counter": 1334,
  "increment": 1335,
  "complex": 1336,
  "real": 1337,
  "imag": 1338,
  "escaped": 1339,
  "\"Hello\\nWorld\\t!\"": 1340,
  "raw": 1341,
  "\"C:\\\\Users\\\\Name\\\\file.txt\"": 1342,
  "10.5": 1343,
  "\" World\"": 1344,
  "h": 1345,
  "\"b\"": 1346,
  "slice": 1347,
  "reversed_arr": 1348,
  "vals": 1349,
  "floor": 1350,
  "3.1": 1351,
  "ceil": 1352,
  "nums": 1353,
  "pow": 1354,
  "sqrt": 1355,
  "sin": 1356,
  "cos": 1357,
  "tan": 1358,
  "log": 1359,
  "exp": 1360,
  "\"Greater than 5\"": 1361,
  "\"Not greater than 5\"": 1362,
  "\"Less than 5\"": 1363,
  "\"Equal to 5\"": 1364,
  "\"Between 0 and 20\"": 1365,
  "\"Between 5 and 15\"": 1366,
  "\"Less than 5 or greater than 10\"": 1367,
  "\"x is False\"": 1368,
  "\"a\"": 1369,
  "\"c\"": 1370,
  "\": \"": 1371,
  "check_positive": 1372,
  "classify": 1373,
  "\"negative\"": 1374,
  "\"zero\"": 1375,
  "\"positive\"": 1376,
  "\"big\"": 1377,
  "\"small\"": 1378,
  "say_hello": 1379,
  "\"Hello!\"": 1380,
  "add": 1381,
  "\"Hi\"": 1382,
  "min_max": 1383,
  "mn": 1384,
  "mx": 1385,
  "factorial": 1386,
  "fib": 1387,
  "outer": 1388,
  "inner": 1389,
  "apply": 1390,
  "double": 1391,
  "square": 1392,
  "doubled": 1393,
  "evens": 1394,
  "sum_list": 1395,
  "make_counter": 1396,
  "compose": 1397,
  "f": 1398,
  "g": 1399,
  "add1": 1400,
  "add_then_double": 1401,
  "sum_all": 1402,
  "arg": 1403,
  "print_info": 1404,
  "info": 1405,
  "log_call": 1406,
  "wrapper": 1407,
  "\"Calling function...\"": 1408,
  "logged_add": 1409,
  "cache": 1410,
  "fib_memo": 1411,
  "range_gen": 1412,
  "empty": 1413,
  "mixed": 1414,
  "\"two\"": 1415,
  "3.0": 1416,
  "arr1": 1417,
  "arr2": 1418,
  "popped": 1419,
  "idx": 1420,
  "cnt": 1421,
  "sort": 1422,
  "reverse": 1423,
  "copy": 1424,
  "clear": 1425,
  "arr3": 1426,
  "squares": 1427,
  "city": 1428,
  "\"NYC\"": 1429,
  "\"Unknown\"": 1430,
  "\"age\"": 1431,
  "removed": 1432,
  "popitem": 1433,
  "val": 1434,
  "update": 1435,
  "setdefault": 1436,
  "address": 1437,
  "\"10001\"": 1438,
  "\"address\"": 1439,
  "\"city\"": 1440,
  "ages": 1441,
  "\"names\"": 1442,
  "people": 1443,
  "h1": 1444,
  "h2": 1445,
  "d": 1446,
  "merged": 1447,
  "v": 1448,
  "counts": 1449,
  "Animal": 1450,
  "__init__": 1451,
  "speak": 1452,
  "\" makes a sound\"": 1453,
  "dog": 1454,
  "\"Dog\"": 1455,
  "Calculator": 1456,
  "subtract": 1457,
  "get_result": 1458,
  "calc": 1459,
  "Dog": 1460,
  "\" says Woof!\"": 1461,
  "Cat": 1462,
  "\" says Meow!\"": 1463,
  "\"Buddy\"": 1464,
  "cat": 1465,
  "\"Whiskers\"": 1466,
  "Counter": 1467,
  "get_count": 1468,
  "c1": 1469,
  "c2": 1470,
  "BankAccount": 1471,
  "balance": 1472,
  "_balance": 1473,
  "deposit": 1474,
  "amount": 1475,
  "withdraw": 1476,
  "get_balance": 1477,
  "account": 1478,
  "MathUtils": 1479,
  "cube": 1480,
  "Rectangle": 1481,
  "width": 1482,
  "height": 1483,
  "area": 1484,
  "perimeter": 1485,
  "rect": 1486,
  "Point": 1487,
  "__str__": 1488,
  "\"(\"": 1489,
  "\")\"": 1490,
  "p": 1491,
  "Money": 1492,
  "__eq__": 1493,
  "other": 1494,
  "__lt__": 1495,
  "m1": 1496,
  "m2": 1497,
  "create_counter": 1498,
  "s1": 1499,
  "s2": 1500,
  "s3": 1501,
  "s": 1502,
  "\"Ha\"": 1503,
  "\"apple,banana,cherry\"": 1504,
  "parts": 1505,
  "\",\"": 1506,
  "\"Hello, Hello, Hello\"": 1507,
  "template": 1508,
  "\"Hello, {}! You are {} years old.\"": 1509,
  "\"12345\"": 1510,
  "3.7": 1511,
  "3.2": 1512,
  "3.14": 1513,
  "gcd": 1514,
  "lcm": 1515,
  "is_prime": 1516,
  "fibonacci": 1517,
  "solve_quadratic": 1518,
  "discriminant": 1519,
  "x1": 1520,
  "x2": 1521,
  "content": 1522,
  "\"Line 1": 1523,
  "Line": 1524,
  "lines": 1525,
  "\"\\n\"": 1526,
  "\"First line\"": 1527,
  "\"Second line\"": 1528,
  "\"Third line\"": 1529,
  "csv_data": 1530,
  "\"name,age,city\\nAlice,30,NYC\\nBob,25,LA\"": 1531,
  "rows": 1532,
  "row": 1533,
  "fields": 1534,
  "\"30\"": 1535,
  "\"25\"": 1536,
  "\"LA\"": 1537,
  "csv": 1538,
  "host": 1539,
  "localhost": 1540,
  "port": 1541,
  "8080": 1542,
  "debug": 1543,
  "true": 1544,
  "\"#\"": 1545,
  "\" = \"": 1546,
  "bubble_sort": 1547,
  "selection_sort": 1548,
  "min_idx": 1549,
  "insertion_sort": 1550,
  "linear_search": 1551,
  "binary_search": 1552,
  "quick_sort": 1553,
  "middle": 1554,
  "merge": 1555,
  "merge_sort": 1556,
  "is_palindrome": 1557,
  "\"radar\"": 1558,
  "is_anagram": 1559,
  "\"listen\"": 1560,
  "\"silent\"": 1561,
  "reverse_string": 1562,
  "pattern": 1563,
  "\"\\\\d+\"": 1564,
  "text": 1565,
  "\"There are 42 apples\"": 1566,
  "\"There are 42 apples and 5 oranges\"": 1567,
  "\"Numbers: 1, 2, 3, 4, 5\"": 1568,
  "repl": 1569,
  "\"NUM\"": 1570,
  "\"I have 42 apples and 5 oranges\"": 1571,
  "\"\\\\s+\"": 1572,
  "\"Hello   World   from   Pyrl\"": 1573,
  "re_split": 1574,
  "\"\\\\w+@\\\\w+\\\\.\\\\w+\"": 1575,
  "\"Contact us at info@example.com\"": 1576,
  "\"\\\\d{3}-\\\\d{3}-\\\\d{4}\"": 1577,
  "\"Call 555-123-4567 for help\"": 1578,
  "\"https?://[\\\\w.]+\"": 1579,
  "\"Visit https://example.com for more\"": 1580,
  "json_str": 1581,
  "'{\"name\": \"Alice\", \"age\": 30}'": 1582,
  "active": 1583,
  "json": 1584,
  "'{\"person\": {\"name\": \"Alice\", \"address\": {\"city\": \"NYC\"}}}'": 1585,
  "\"person\"": 1586,
  "'[1, 2, 3, 4, 5]'": 1587,
  "id": 1588,
  "\"Item 1\"": 1589,
  "\"Item 2\"": 1590,
  "'{\"result\": \"success\"}'": 1591,
  "\"status\"": 1592,
  "\"data\"": 1593,
  "\"result\"": 1594,
  "request_data": 1595,
  "username": 1596,
  "\"admin\"": 1597,
  "password": 1598,
  "\"secret\"": 1599,
  "json_body": 1600,
  "api_response": 1601,
  "'{\"users\": [{\"id\": 1, \"name\": \"Alice\"}, {\"id\": 2, \"name\": \"Bob\"}]}'": 1602,
  "parsed": 1603,
  "user": 1604,
  "\"users\"": 1605,
  "\"Not found\"": 1606,
  "\"Error: \"": 1607,
  "\"error\"": 1608,
  "handle_request": 1609,
  "\"/\"": 1610,
  "body": 1611,
  "\"Welcome!\"": 1612,
  "\"/api\"": 1613,
  "\"ok\"": 1614,
  "routes": 1615,
  "\"home\"": 1616,
  "\"/about\"": 1617,
  "\"about_page\"": 1618,
  "\"/contact\"": 1619,
  "\"contact_page\"": 1620,
  "route": 1621,
  "\"404\"": 1622,
  "get_cached": 1623,
  "default": 1624,
  "events": 1625,
  "on": 1626,
  "event": 1627,
  "emit": 1628,
  "\"greet\"": 1629,
  "state": 1630,
  "\"idle\"": 1631,
  "transition": 1632,
  "action": 1633,
  "\"start\"": 1634,
  "\"running\"": 1635,
  "\"pause\"": 1636,
  "\"paused\"": 1637,
  "\"stop\"": 1638,
  "\"resume\"": 1639,
  "create_promise": 1640,
  "then": 1641,
  "\"value\"": 1642,
  "create_observable": 1643,
  "subscribers": 1644,
  "subscribe": 1645,
  "notify": 1646,
  "sub": 1647,
  "obs": 1648,
  "\"Got: \"": 1649,
  "services": 1650,
  "register": 1651,
  "factory": 1652,
  "resolve": 1653,
  "\"config\"": 1654,
  "create_middleware": 1655,
  "handlers": 1656,
  "use": 1657,
  "mw": 1658,
  "validate_email": 1659,
  "email": 1660,
  "\"@\"": 1661,
  "\".\"": 1662,
  "\"test@example.com\"": 1663,
  "\"invalid\"": 1664,
  "create_logger": 1665,
  "prefix": 1666,
  "logger": 1667,
  "\"APP\"": 1668,
  "\"Starting application\"": 1669,
  "start_time": 1670,
  "start_timer": 1671,
  "tick": 1672,
  "requests": 1673,
  "rate_limit": 1674,
  "limit": 1675,
  "\"api\"": 1676,
  "channels": 1677,
  "channel": 1678,
  "publish": 1679,
  "\"news\"": 1680,
  "\"News: \"": 1681,
  "\"New version released!\"": 1682,
  "memo_cache": 1683,
  "memoize": 1684,
  "\"expensive\"": 1685,
  "last_call": 1686,
  "debounce": 1687,
  "delay": 1688,
  "current": 1689,
  "last_exec": 1690,
  "throttle": 1691,
  "interval": 1692,
  "retry": 1693,
  "attempts": 1694,
  "queue": 1695,
  "enqueue": 1696,
  "dequeue": 1697,
  "stack": 1698,
  "push": 1699,
  "pop_stack": 1700,
  "ListNode": 1701,
  "node1": 1702,
  "node2": 1703,
  "TreeNode": 1704,
  "root": 1705,
  "inorder_traversal": 1706,
  "graph": 1707,
  "\"B\"": 1708,
  "\"C\"": 1709,
  "\"D\"": 1710,
  "bfs": 1711,
  "visited": 1712,
  "neighbor": 1713,
  "dfs": 1714,
  "make_accumulator": 1715,
  "initial": 1716,
  "accumulate": 1717,
  "identity": 1718,
  "always": 1719,
  "always_true": 1720,
  "complement": 1721,
  "is_even": 1722,
  "is_odd": 1723,
  "flip": 1724,
  "pipe": 1725,
  "funcs": 1726,
  "piped": 1727,
  "compose_funcs": 1728,
  "curry2": 1729,
  "curried_add": 1730,
  "add_5": 1731,
  "partial": 1732,
  "fixed": 1733,
  "zip_with": 1734,
  "list1": 1735,
  "list2": 1736,
  "min_len": 1737,
  "sums": 1738,
  "take": 1739,
  "drop": 1740,
  "take_while": 1741,
  "pred": 1742,
  "drop_while": 1743,
  "dropping": 1744,
  "false": 1745,
  "group_by": 1746,
  "key_func": 1747,
  "groups": 1748,
  "flatten": 1749,
  "interleave": 1750,
  "intersperse": 1751,
  "sep": 1752,
  "unique": 1753,
  "frequencies": 1754,
  "freq": 1755,
  "intersection": 1756,
  "union": 1757,
  "Person": 1758,
  "skills": 1759,
  "\"Python\"": 1760,
  "\"JavaScript\"": 1761,
  "greet_person": 1762,
  "is_adult": 1763,
  "format_skills": 1764,
  "\" is an adult\"": 1765,
  "skills_str": 1766,
  "\"skills\"": 1767,
  "\"Skills: \"": 1768,
  "upper_skills": 1769,
  "skill": 1770,
  "\"Skill: \"": 1771,
  "stats": 1772,
  "total_skills": 1773,
  "name_length": 1774,
  "is_developer": 1775,
  "\"--- Statistics ---\"": 1776,
  "\"Program complete!\"": 1777
}