{
  "<pad>": 0,
  "<unk>": 1,
  "<bos>": 2,
  "<eos>": 3,
  "<mask>": 4,
  "<newline>": 5,
  "<indent>": 6,
  "<dedent>": 7,
  "$": 10,
  "@": 11,
  "%": 74,
  "&": 13,
  "if": 20,
  "elif": 21,
  "else": 22,
  "while": 23,
  "for": 24,
  "in": 25,
  "def": 26,
  "return": 27,
  "lambda": 28,
  "class": 29,
  "self": 30,
  "try": 31,
  "except": 32,
  "finally": 33,
  "raise": 34,
  "import": 35,
  "from": 36,
  "as": 37,
  "True": 38,
  "False": 39,
  "None": 40,
  "and": 41,
  "or": 42,
  "not": 43,
  "is": 44,
  "break": 46,
  "continue": 47,
  "pass": 48,
  "with": 49,
  "yield": 50,
  "global": 51,
  "nonlocal": 52,
  "assert": 53,
  "del": 54,
  "extends": 55,
  "method": 56,
  "init": 57,
  "prop": 58,
  "test": 59,
  "vue": 60,
  "print": 120,
  "+": 70,
  "-": 71,
  "*": 72,
  "/": 73,
  "**": 75,
  "//": 76,
  "==": 77,
  "!=": 78,
  "<": 79,
  ">": 80,
  "<=": 81,
  ">=": 82,
  "=~": 83,
  "!~": 84,
  "=": 85,
  "+=": 86,
  "-=": 87,
  "*=": 88,
  "/=": 89,
  "->": 90,
  "=>": 91,
  "^": 92,
  "(": 100,
  ")": 101,
  "[": 102,
  "]": 103,
  "{": 104,
  "}": 105,
  ",": 106,
  ":": 107,
  ".": 108,
  ";": 109,
  "len": 121,
  "range": 122,
  "str": 123,
  "int": 124,
  "float": 125,
  "bool": 126,
  "list": 127,
  "dict": 128,
  "set": 129,
  "tuple": 130,
  "type": 131,
  "isinstance": 132,
  "abs": 133,
  "round": 134,
  "min": 135,
  "max": 136,
  "sum": 137,
  "sorted": 138,
  "reversed": 139,
  "enumerate": 140,
  "zip": 141,
  "map": 142,
  "filter": 143,
  "upper": 144,
  "lower": 145,
  "strip": 146,
  "split": 147,
  "join": 148,
  "replace": 149,
  "find": 150,
  "format": 151,
  "append": 152,
  "extend": 153,
  "insert": 154,
  "remove": 155,
  "pop": 156,
  "keys": 157,
  "values": 158,
  "items": 159,
  "get": 160,
  "open": 161,
  "input": 162,
  "time": 163,
  "datetime": 164,
  "json_parse": 165,
  "json_stringify": 166,
  "re_match": 167,
  "re_search": 168,
  "re_findall": 169,
  "re_sub": 170,
  "html_response": 171,
  "json_response": 172,
  "redirect": 173,
  "parse_form": 174,
  "parse_cookies": 175,
  "parse_json": 176,
  "http_get": 177,
  "http_post": 178,
  "hash_password": 179,
  "verify_password": 180,
  "generate_token": 181,
  "validate_token": 182,
  "name": 250,
  "value": 251,
  "result": 252,
  "data": 253,
  "item": 254,
  "key": 255,
  "index": 256,
  "count": 257,
  "x": 258,
  "y": 259,
  "z": 260,
  "i": 261,
  "j": 262,
  "k": 263,
  "n": 264,
  "m": 265,
  "arr": 266,
  "hash": 267,
  "func": 268,
  "callback": 269,
  "handler": 270,
  "start": 271,
  "end": 272,
  "step": 273,
  "size": 274,
  "length": 275,
  "first": 276,
  "last": 277,
  "next": 278,
  "prev": 279,
  "left": 280,
  "right": 281,
  "mid": 282,
  "pivot": 283,
  "total": 284,
  "avg": 285,
  "error": 286,
  "message": 287,
  "status": 288,
  "response": 289,
  "config": 290,
  "options": 291,
  "params": 292,
  "args": 293,
  "hello": 294,
  "world": 295,
  "example": 296,
  "main": 297,
  "run": 298,
  "execute": 299,
  "process": 300,
  "file": 301,
  "path": 302,
  "dir": 303,
  "line": 304,
  "column": 305,
  "token": 306,
  "node": 307,
  "ast": 308,
  "request": 309,
  "session": 310,
  "user": 311,
  "app": 312,
  "handle_request": 313,
  "body": 314,
  "username": 315,
  "password": 316,
  "email": 317,
  "login": 318,
  "logout": 319,
  "dashboard": 320,
  "api": 321,
  "success": 322,
  "fail": 323,
  "0": 1000,
  "1": 1001,
  "2": 1002,
  "3": 1003,
  "4": 1004,
  "5": 1005,
  "6": 1006,
  "7": 1007,
  "8": 1008,
  "9": 1009,
  "10": 1010,
  "11": 1011,
  "12": 1012,
  "13": 1013,
  "14": 1014,
  "15": 1015,
  "16": 1016,
  "17": 1017,
  "18": 1018,
  "19": 1019,
  "20": 1020,
  "21": 1021,
  "22": 1022,
  "23": 1023,
  "24": 1024,
  "25": 1025,
  "26": 1026,
  "27": 1027,
  "28": 1028,
  "29": 1029,
  "30": 1030,
  "31": 1031,
  "32": 1032,
  "33": 1033,
  "34": 1034,
  "35": 1035,
  "36": 1036,
  "37": 1037,
  "38": 1038,
  "39": 1039,
  "40": 1040,
  "41": 1041,
  "42": 1042,
  "43": 1043,
  "44": 1044,
  "45": 1045,
  "46": 1046,
  "47": 1047,
  "48": 1048,
  "49": 1049,
  "50": 1050,
  "51": 1051,
  "52": 1052,
  "53": 1053,
  "54": 1054,
  "55": 1055,
  "56": 1056,
  "57": 1057,
  "58": 1058,
  "59": 1059,
  "60": 1060,
  "61": 1061,
  "62": 1062,
  "63": 1063,
  "64": 1064,
  "65": 1065,
  "66": 1066,
  "67": 1067,
  "68": 1068,
  "69": 1069,
  "70": 1070,
  "71": 1071,
  "72": 1072,
  "73": 1073,
  "74": 1074,
  "75": 1075,
  "76": 1076,
  "77": 1077,
  "78": 1078,
  "79": 1079,
  "80": 1080,
  "81": 1081,
  "82": 1082,
  "83": 1083,
  "84": 1084,
  "85": 1085,
  "86": 1086,
  "87": 1087,
  "88": 1088,
  "89": 1089,
  "90": 1090,
  "91": 1091,
  "92": 1092,
  "93": 1093,
  "94": 1094,
  "95": 1095,
  "96": 1096,
  "97": 1097,
  "98": 1098,
  "99": 1099,
  "100": 1100,
  "101": 1101,
  "102": 1102,
  "103": 1103,
  "104": 1104,
  "105": 1105,
  "106": 1106,
  "107": 1107,
  "108": 1108,
  "109": 1109,
  "110": 1110,
  "111": 1111,
  "112": 1112,
  "113": 1113,
  "114": 1114,
  "115": 1115,
  "116": 1116,
  "117": 1117,
  "118": 1118,
  "119": 1119,
  "120": 1120,
  "121": 1121,
  "122": 1122,
  "123": 1123,
  "124": 1124,
  "125": 1125,
  "126": 1126,
  "127": 1127,
  "128": 1128,
  "129": 1129,
  "130": 1130,
  "131": 1131,
  "132": 1132,
  "133": 1133,
  "134": 1134,
  "135": 1135,
  "136": 1136,
  "137": 1137,
  "138": 1138,
  "139": 1139,
  "140": 1140,
  "141": 1141,
  "142": 1142,
  "143": 1143,
  "144": 1144,
  "145": 1145,
  "146": 1146,
  "147": 1147,
  "148": 1148,
  "149": 1149,
  "150": 1150,
  "151": 1151,
  "152": 1152,
  "153": 1153,
  "154": 1154,
  "155": 1155,
  "156": 1156,
  "157": 1157,
  "158": 1158,
  "159": 1159,
  "160": 1160,
  "161": 1161,
  "162": 1162,
  "163": 1163,
  "164": 1164,
  "165": 1165,
  "166": 1166,
  "167": 1167,
  "168": 1168,
  "169": 1169,
  "170": 1170,
  "171": 1171,
  "172": 1172,
  "173": 1173,
  "174": 1174,
  "175": 1175,
  "176": 1176,
  "177": 1177,
  "178": 1178,
  "179": 1179,
  "180": 1180,
  "181": 1181,
  "182": 1182,
  "183": 1183,
  "184": 1184,
  "185": 1185,
  "186": 1186,
  "187": 1187,
  "188": 1188,
  "189": 1189,
  "190": 1190,
  "191": 1191,
  "192": 1192,
  "193": 1193,
  "194": 1194,
  "195": 1195,
  "196": 1196,
  "197": 1197,
  "198": 1198,
  "199": 1199,
  "200": 1200,
  "201": 1201,
  "202": 1202,
  "203": 1203,
  "204": 1204,
  "205": 1205,
  "206": 1206,
  "207": 1207,
  "208": 1208,
  "209": 1209,
  "210": 1210,
  "211": 1211,
  "212": 1212,
  "213": 1213,
  "214": 1214,
  "215": 1215,
  "216": 1216,
  "217": 1217,
  "218": 1218,
  "219": 1219,
  "220": 1220,
  "221": 1221,
  "222": 1222,
  "223": 1223,
  "224": 1224,
  "225": 1225,
  "226": 1226,
  "227": 1227,
  "228": 1228,
  "229": 1229,
  "230": 1230,
  "231": 1231,
  "232": 1232,
  "233": 1233,
  "234": 1234,
  "235": 1235,
  "236": 1236,
  "237": 1237,
  "238": 1238,
  "239": 1239,
  "240": 1240,
  "241": 1241,
  "242": 1242,
  "243": 1243,
  "244": 1244,
  "245": 1245,
  "246": 1246,
  "247": 1247,
  "248": 1248,
  "249": 1249,
  "250": 1250,
  "251": 1251,
  "252": 1252,
  "253": 1253,
  "254": 1254,
  "255": 1255,
  "256": 1256,
  "257": 1257,
  "258": 1258,
  "259": 1259,
  "260": 1260,
  "261": 1261,
  "262": 1262,
  "263": 1263,
  "264": 1264,
  "265": 1265,
  "266": 1266,
  "267": 1267,
  "268": 1268,
  "269": 1269,
  "270": 1270,
  "271": 1271,
  "272": 1272,
  "273": 1273,
  "274": 1274,
  "275": 1275,
  "276": 1276,
  "277": 1277,
  "278": 1278,
  "279": 1279,
  "280": 1280,
  "281": 1281,
  "282": 1282,
  "283": 1283,
  "284": 1284,
  "285": 1285,
  "286": 1286,
  "287": 1287,
  "288": 1288,
  "289": 1289,
  "290": 1290,
  "291": 1291,
  "292": 1292,
  "293": 1293,
  "294": 1294,
  "295": 1295,
  "296": 1296,
  "297": 1297,
  "298": 1298,
  "299": 1299,
  "300": 1300,
  "301": 1301,
  "302": 1302,
  "303": 1303,
  "304": 1304,
  "305": 1305,
  "306": 1306,
  "307": 1307,
  "308": 1308,
  "309": 1309,
  "310": 1310,
  "311": 1311,
  "312": 1312,
  "313": 1313,
  "314": 1314,
  "315": 1315,
  "316": 1316,
  "317": 1317,
  "318": 1318,
  "319": 1319,
  "320": 1320,
  "321": 1321,
  "322": 1322,
  "323": 1323,
  "324": 1324,
  "325": 1325,
  "326": 1326,
  "327": 1327,
  "328": 1328,
  "329": 1329,
  "330": 1330,
  "331": 1331,
  "332": 1332,
  "333": 1333,
  "334": 1334,
  "335": 1335,
  "336": 1336,
  "337": 1337,
  "338": 1338,
  "339": 1339,
  "340": 1340,
  "341": 1341,
  "342": 1342,
  "343": 1343,
  "344": 1344,
  "345": 1345,
  "346": 1346,
  "347": 1347,
  "348": 1348,
  "349": 1349,
  "350": 1350,
  "351": 1351,
  "352": 1352,
  "353": 1353,
  "354": 1354,
  "355": 1355,
  "356": 1356,
  "357": 1357,
  "358": 1358,
  "359": 1359,
  "360": 1360,
  "361": 1361,
  "362": 1362,
  "363": 1363,
  "364": 1364,
  "365": 1365,
  "366": 1366,
  "367": 1367,
  "368": 1368,
  "369": 1369,
  "370": 1370,
  "371": 1371,
  "372": 1372,
  "373": 1373,
  "374": 1374,
  "375": 1375,
  "376": 1376,
  "377": 1377,
  "378": 1378,
  "379": 1379,
  "380": 1380,
  "381": 1381,
  "382": 1382,
  "383": 1383,
  "384": 1384,
  "385": 1385,
  "386": 1386,
  "387": 1387,
  "388": 1388,
  "389": 1389,
  "390": 1390,
  "391": 1391,
  "392": 1392,
  "393": 1393,
  "394": 1394,
  "395": 1395,
  "396": 1396,
  "397": 1397,
  "398": 1398,
  "399": 1399,
  "400": 1400,
  "401": 1401,
  "402": 1402,
  "403": 1403,
  "404": 1404,
  "405": 1405,
  "406": 1406,
  "407": 1407,
  "408": 1408,
  "409": 1409,
  "410": 1410,
  "411": 1411,
  "412": 1412,
  "413": 1413,
  "414": 1414,
  "415": 1415,
  "416": 1416,
  "417": 1417,
  "418": 1418,
  "419": 1419,
  "420": 1420,
  "421": 1421,
  "422": 1422,
  "423": 1423,
  "424": 1424,
  "425": 1425,
  "426": 1426,
  "427": 1427,
  "428": 1428,
  "429": 1429,
  "430": 1430,
  "431": 1431,
  "432": 1432,
  "433": 1433,
  "434": 1434,
  "435": 1435,
  "436": 1436,
  "437": 1437,
  "438": 1438,
  "439": 1439,
  "440": 1440,
  "441": 1441,
  "442": 1442,
  "443": 1443,
  "444": 1444,
  "445": 1445,
  "446": 1446,
  "447": 1447,
  "448": 1448,
  "449": 1449,
  "450": 1450,
  "451": 1451,
  "452": 1452,
  "453": 1453,
  "454": 1454,
  "455": 1455,
  "456": 1456,
  "457": 1457,
  "458": 1458,
  "459": 1459,
  "460": 1460,
  "461": 1461,
  "462": 1462,
  "463": 1463,
  "464": 1464,
  "465": 1465,
  "466": 1466,
  "467": 1467,
  "468": 1468,
  "469": 1469,
  "470": 1470,
  "471": 1471,
  "472": 1472,
  "473": 1473,
  "474": 1474,
  "475": 1475,
  "476": 1476,
  "477": 1477,
  "478": 1478,
  "479": 1479,
  "480": 1480,
  "481": 1481,
  "482": 1482,
  "483": 1483,
  "484": 1484,
  "485": 1485,
  "486": 1486,
  "487": 1487,
  "488": 1488,
  "489": 1489,
  "490": 1490,
  "491": 1491,
  "492": 1492,
  "493": 1493,
  "494": 1494,
  "495": 1495,
  "496": 1496,
  "497": 1497,
  "498": 1498,
  "499": 1499,
  "500": 1500,
  "501": 1501,
  "502": 1502,
  "503": 1503,
  "504": 1504,
  "505": 1505,
  "506": 1506,
  "507": 1507,
  "508": 1508,
  "509": 1509,
  "510": 1510,
  "511": 1511,
  "512": 1512,
  "513": 1513,
  "514": 1514,
  "515": 1515,
  "516": 1516,
  "517": 1517,
  "518": 1518,
  "519": 1519,
  "520": 1520,
  "521": 1521,
  "522": 1522,
  "523": 1523,
  "524": 1524,
  "525": 1525,
  "526": 1526,
  "527": 1527,
  "528": 1528,
  "529": 1529,
  "530": 1530,
  "531": 1531,
  "532": 1532,
  "533": 1533,
  "534": 1534,
  "535": 1535,
  "536": 1536,
  "537": 1537,
  "538": 1538,
  "539": 1539,
  "540": 1540,
  "541": 1541,
  "542": 1542,
  "543": 1543,
  "544": 1544,
  "545": 1545,
  "546": 1546,
  "547": 1547,
  "548": 1548,
  "549": 1549,
  "550": 1550,
  "551": 1551,
  "552": 1552,
  "553": 1553,
  "554": 1554,
  "555": 1555,
  "556": 1556,
  "557": 1557,
  "558": 1558,
  "559": 1559,
  "560": 1560,
  "561": 1561,
  "562": 1562,
  "563": 1563,
  "564": 1564,
  "565": 1565,
  "566": 1566,
  "567": 1567,
  "568": 1568,
  "569": 1569,
  "570": 1570,
  "571": 1571,
  "572": 1572,
  "573": 1573,
  "574": 1574,
  "575": 1575,
  "576": 1576,
  "577": 1577,
  "578": 1578,
  "579": 1579,
  "580": 1580,
  "581": 1581,
  "582": 1582,
  "583": 1583,
  "584": 1584,
  "585": 1585,
  "586": 1586,
  "587": 1587,
  "588": 1588,
  "589": 1589,
  "590": 1590,
  "591": 1591,
  "592": 1592,
  "593": 1593,
  "594": 1594,
  "595": 1595,
  "596": 1596,
  "597": 1597,
  "598": 1598,
  "599": 1599,
  "600": 1600,
  "601": 1601,
  "602": 1602,
  "603": 1603,
  "604": 1604,
  "605": 1605,
  "606": 1606,
  "607": 1607,
  "608": 1608,
  "609": 1609,
  "610": 1610,
  "611": 1611,
  "612": 1612,
  "613": 1613,
  "614": 1614,
  "615": 1615,
  "616": 1616,
  "617": 1617,
  "618": 1618,
  "619": 1619,
  "620": 1620,
  "621": 1621,
  "622": 1622,
  "623": 1623,
  "624": 1624,
  "625": 1625,
  "626": 1626,
  "627": 1627,
  "628": 1628,
  "629": 1629,
  "630": 1630,
  "631": 1631,
  "632": 1632,
  "633": 1633,
  "634": 1634,
  "635": 1635,
  "636": 1636,
  "637": 1637,
  "638": 1638,
  "639": 1639,
  "640": 1640,
  "641": 1641,
  "642": 1642,
  "643": 1643,
  "644": 1644,
  "645": 1645,
  "646": 1646,
  "647": 1647,
  "648": 1648,
  "649": 1649,
  "650": 1650,
  "651": 1651,
  "652": 1652,
  "653": 1653,
  "654": 1654,
  "655": 1655,
  "656": 1656,
  "657": 1657,
  "658": 1658,
  "659": 1659,
  "660": 1660,
  "661": 1661,
  "662": 1662,
  "663": 1663,
  "664": 1664,
  "665": 1665,
  "666": 1666,
  "667": 1667,
  "668": 1668,
  "669": 1669,
  "670": 1670,
  "671": 1671,
  "672": 1672,
  "673": 1673,
  "674": 1674,
  "675": 1675,
  "676": 1676,
  "677": 1677,
  "678": 1678,
  "679": 1679,
  "680": 1680,
  "681": 1681,
  "682": 1682,
  "683": 1683,
  "684": 1684,
  "685": 1685,
  "686": 1686,
  "687": 1687,
  "688": 1688,
  "689": 1689,
  "690": 1690,
  "691": 1691,
  "692": 1692,
  "693": 1693,
  "694": 1694,
  "695": 1695,
  "696": 1696,
  "697": 1697,
  "698": 1698,
  "699": 1699,
  "700": 1700,
  "701": 1701,
  "702": 1702,
  "703": 1703,
  "704": 1704,
  "705": 1705,
  "706": 1706,
  "707": 1707,
  "708": 1708,
  "709": 1709,
  "710": 1710,
  "711": 1711,
  "712": 1712,
  "713": 1713,
  "714": 1714,
  "715": 1715,
  "716": 1716,
  "717": 1717,
  "718": 1718,
  "719": 1719,
  "720": 1720,
  "721": 1721,
  "722": 1722,
  "723": 1723,
  "724": 1724,
  "725": 1725,
  "726": 1726,
  "727": 1727,
  "728": 1728,
  "729": 1729,
  "730": 1730,
  "731": 1731,
  "732": 1732,
  "733": 1733,
  "734": 1734,
  "735": 1735,
  "736": 1736,
  "737": 1737,
  "738": 1738,
  "739": 1739,
  "740": 1740,
  "741": 1741,
  "742": 1742,
  "743": 1743,
  "744": 1744,
  "745": 1745,
  "746": 1746,
  "747": 1747,
  "748": 1748,
  "749": 1749,
  "750": 1750,
  "751": 1751,
  "752": 1752,
  "753": 1753,
  "754": 1754,
  "755": 1755,
  "756": 1756,
  "757": 1757,
  "758": 1758,
  "759": 1759,
  "760": 1760,
  "761": 1761,
  "762": 1762,
  "763": 1763,
  "764": 1764,
  "765": 1765,
  "766": 1766,
  "767": 1767,
  "768": 1768,
  "769": 1769,
  "770": 1770,
  "771": 1771,
  "772": 1772,
  "773": 1773,
  "774": 1774,
  "775": 1775,
  "776": 1776,
  "777": 1777,
  "778": 1778,
  "779": 1779,
  "780": 1780,
  "781": 1781,
  "782": 1782,
  "783": 1783,
  "784": 1784,
  "785": 1785,
  "786": 1786,
  "787": 1787,
  "788": 1788,
  "789": 1789,
  "790": 1790,
  "791": 1791,
  "792": 1792,
  "793": 1793,
  "794": 1794,
  "795": 1795,
  "796": 1796,
  "797": 1797,
  "798": 1798,
  "799": 1799,
  "800": 1800,
  "801": 1801,
  "802": 1802,
  "803": 1803,
  "804": 1804,
  "805": 1805,
  "806": 1806,
  "807": 1807,
  "808": 1808,
  "809": 1809,
  "810": 1810,
  "811": 1811,
  "812": 1812,
  "813": 1813,
  "814": 1814,
  "815": 1815,
  "816": 1816,
  "817": 1817,
  "818": 1818,
  "819": 1819,
  "820": 1820,
  "821": 1821,
  "822": 1822,
  "823": 1823,
  "824": 1824,
  "825": 1825,
  "826": 1826,
  "827": 1827,
  "828": 1828,
  "829": 1829,
  "830": 1830,
  "831": 1831,
  "832": 1832,
  "833": 1833,
  "834": 1834,
  "835": 1835,
  "836": 1836,
  "837": 1837,
  "838": 1838,
  "839": 1839,
  "840": 1840,
  "841": 1841,
  "842": 1842,
  "843": 1843,
  "844": 1844,
  "845": 1845,
  "846": 1846,
  "847": 1847,
  "848": 1848,
  "849": 1849,
  "850": 1850,
  "851": 1851,
  "852": 1852,
  "853": 1853,
  "854": 1854,
  "855": 1855,
  "856": 1856,
  "857": 1857,
  "858": 1858,
  "859": 1859,
  "860": 1860,
  "861": 1861,
  "862": 1862,
  "863": 1863,
  "864": 1864,
  "865": 1865,
  "866": 1866,
  "867": 1867,
  "868": 1868,
  "869": 1869,
  "870": 1870,
  "871": 1871,
  "872": 1872,
  "873": 1873,
  "874": 1874,
  "875": 1875,
  "876": 1876,
  "877": 1877,
  "878": 1878,
  "879": 1879,
  "880": 1880,
  "881": 1881,
  "882": 1882,
  "883": 1883,
  "884": 1884,
  "885": 1885,
  "886": 1886,
  "887": 1887,
  "888": 1888,
  "889": 1889,
  "890": 1890,
  "891": 1891,
  "892": 1892,
  "893": 1893,
  "894": 1894,
  "895": 1895,
  "896": 1896,
  "897": 1897,
  "898": 1898,
  "899": 1899,
  "900": 1900,
  "901": 1901,
  "902": 1902,
  "903": 1903,
  "904": 1904,
  "905": 1905,
  "906": 1906,
  "907": 1907,
  "908": 1908,
  "909": 1909,
  "910": 1910,
  "911": 1911,
  "912": 1912,
  "913": 1913,
  "914": 1914,
  "915": 1915,
  "916": 1916,
  "917": 1917,
  "918": 1918,
  "919": 1919,
  "920": 1920,
  "921": 1921,
  "922": 1922,
  "923": 1923,
  "924": 1924,
  "925": 1925,
  "926": 1926,
  "927": 1927,
  "928": 1928,
  "929": 1929,
  "930": 1930,
  "931": 1931,
  "932": 1932,
  "933": 1933,
  "934": 1934,
  "935": 1935,
  "936": 1936,
  "937": 1937,
  "938": 1938,
  "939": 1939,
  "940": 1940,
  "941": 1941,
  "942": 1942,
  "943": 1943,
  "944": 1944,
  "945": 1945,
  "946": 1946,
  "947": 1947,
  "948": 1948,
  "949": 1949,
  "950": 1950,
  "951": 1951,
  "952": 1952,
  "953": 1953,
  "954": 1954,
  "955": 1955,
  "956": 1956,
  "957": 1957,
  "958": 1958,
  "959": 1959,
  "960": 1960,
  "961": 1961,
  "962": 1962,
  "963": 1963,
  "964": 1964,
  "965": 1965,
  "966": 1966,
  "967": 1967,
  "968": 1968,
  "969": 1969,
  "970": 1970,
  "971": 1971,
  "972": 1972,
  "973": 1973,
  "974": 1974,
  "975": 1975,
  "976": 1976,
  "977": 1977,
  "978": 1978,
  "979": 1979,
  "980": 1980,
  "981": 1981,
  "982": 1982,
  "983": 1983,
  "984": 1984,
  "985": 1985,
  "986": 1986,
  "987": 1987,
  "988": 1988,
  "989": 1989,
  "990": 1990,
  "991": 1991,
  "992": 1992,
  "993": 1993,
  "994": 1994,
  "995": 1995,
  "996": 1996,
  "997": 1997,
  "998": 1998,
  "999": 1999,
  "1000": 2000,
  "\"Pyrl Examples - See files in examples/ directory\"": 1222,
  "\"Run: python pyrl_cli.py examples/<filename>.pyrl\"": 1223,
  "\"Hello, World!\"": 1224,
  "\"Pyrl\"": 1225,
  "\"Welcome to \"": 1226,
  "\"!\"": 1227,
  "greeting": 1228,
  "\"Hello\"": 1229,
  "target": 1230,
  "\"World\"": 1231,
  "\", \"": 1232,
  "\"Alice\"": 1233,
  "age": 1234,
  "price": 1235,
  "19.99": 1236,
  "active": 1237,
  "empty": 1238,
  "\"=== Scalar Variables ===\"": 1239,
  "numbers": 1240,
  "fruits": 1241,
  "\"apple\"": 1242,
  "\"banana\"": 1243,
  "\"cherry\"": 1244,
  "\"=== Array Variables ===\"": 1245,
  "person": 1246,
  "\"name\"": 1247,
  "\"Bob\"": 1248,
  "\"age\"": 1249,
  "\"host\"": 1250,
  "\"localhost\"": 1251,
  "\"port\"": 1252,
  "8080": 1253,
  "\"=== Hash Variables ===\"": 1254,
  "\"=== Variables Demo Complete ===\"": 1255,
  "\"=== Arithmetic Operators ===\"": 1256,
  "\"10 + 20 = \"": 1257,
  "diff": 1258,
  "\"100 - 35 = \"": 1259,
  "product": 1260,
  "\"7 * 8 = \"": 1261,
  "quotient": 1262,
  "\"100 / 4 = \"": 1263,
  "floor_div": 1264,
  "\"17 // 3 = \"": 1265,
  "modulo": 1266,
  "\"17 % 5 = \"": 1267,
  "neg": 1268,
  "\"-42 = \"": 1269,
  "\"=== Comparison Operators ===\"": 1270,
  "equal": 1271,
  "\"30 == 30: \"": 1272,
  "not_equal": 1273,
  "\"hello\"": 1274,
  "\"world\"": 1275,
  "\"hello != world: \"": 1276,
  "less": 1277,
  "\"10 < 20: \"": 1278,
  "greater": 1279,
  "\"50 > 25: \"": 1280,
  "\"=== Logical Operators ===\"": 1281,
  "and_result": 1282,
  "\"True and False: \"": 1283,
  "or_result": 1284,
  "\"True or False: \"": 1285,
  "not_result": 1286,
  "\"not False: \"": 1287,
  "\"=== Operators Demo Complete ===\"": 1288,
  "integer": 1289,
  "float_num": 1290,
  "3.14159": 1291,
  "negative": 1292,
  "big_num": 1293,
  "15000000000": 1294,
  "\"Integer: \"": 1295,
  "\"Float: \"": 1296,
  "multiline": 1297,
  "\"Line 1\\nLine 2\\nLine 3\"": 1298,
  "escaped": 1299,
  "\"She said \\\"Hello\\\"\"": 1300,
  "\"Name: \"": 1301,
  "is_active": 1302,
  "is_complete": 1303,
  "\"Active: \"": 1304,
  "\"Empty: \"": 1305,
  "names": 1306,
  "\"Charlie\"": 1307,
  "mixed": 1308,
  "\"two\"": 1309,
  "3.0": 1310,
  "empty_array": 1311,
  "\"Numbers: \"": 1312,
  "\"First number: \"": 1313,
  "\"Names count: \"": 1314,
  "\"John\"": 1315,
  "city": 1316,
  "\"New York\"": 1317,
  "debug": 1318,
  "port": 1319,
  "8000": 1320,
  "host": 1321,
  "\"Person name: \"": 1322,
  "\"Person age: \"": 1323,
  "greet": 1324,
  "\"Hello, \"": 1325,
  "\"=== Array Access ===\"": 1326,
  "\"First element: \"": 1327,
  "third": 1328,
  "\"Third element: \"": 1329,
  "\"After change: \"": 1330,
  "\"=== Hash Access ===\"": 1331,
  "\"Age: \"": 1332,
  "\"After age change: \"": 1333,
  "\"=== Access Demo Complete ===\"": 1334,
  "\"Positive number\"": 1335,
  "\"Negative number\"": 1336,
  "\"Zero\"": 1337,
  "has_id": 1338,
  "\"Access granted\"": 1339,
  "\"ID required\"": 1340,
  "\"Too young\"": 1341,
  "\"Count: \"": 1342,
  "running": 1343,
  "\"Iteration \"": 1344,
  "\"Range iteration:\"": 1345,
  "\"Fruit iteration:\"": 1346,
  "fruit": 1347,
  "\"  - \"": 1348,
  "\"first\"": 1349,
  "\"second\"": 1350,
  "\"third\"": 1351,
  "pair": 1352,
  "\"Even numbers 0-9:\"": 1353,
  "found": 1354,
  "num": 1355,
  "\"Found: \"": 1356,
  "\"Multiplication table (partial):\"": 1357,
  "\" x \"": 1358,
  "\" -> \"": 1359,
  "\"=== If/Elif/Else ===\"": 1360,
  "\"Adult\"": 1361,
  "\"Teenager\"": 1362,
  "\"Child\"": 1363,
  "\"=== For Loop ===\"": 1364,
  "\"Iteration: \"": 1365,
  "\"=== For Loop with Array ===\"": 1366,
  "\"Fruit: \"": 1367,
  "\"=== While Loop ===\"": 1368,
  "\"=== Control Flow Demo Complete ===\"": 1369,
  "say_hello": 1370,
  "\"Hello from Pyrl!\"": 1371,
  "add": 1372,
  "a": 1373,
  "b": 1374,
  "\"5 + 3 = \"": 1375,
  "create_person": 1376,
  "\"London\"": 1377,
  "\"Created person: \"": 1378,
  "calculate_area": 1379,
  "width": 1380,
  "height": 1381,
  "area": 1382,
  "room_area": 1383,
  "\"Room area: \"": 1384,
  "factorial": 1385,
  "\"5! = \"": 1386,
  "fibonacci": 1387,
  "\"Fibonacci(10) = \"": 1388,
  "get_grade": 1389,
  "score": 1390,
  "\"A\"": 1391,
  "\"B\"": 1392,
  "\"C\"": 1393,
  "\"D\"": 1394,
  "\"F\"": 1395,
  "scores": 1396,
  "grade": 1397,
  "\"Score \"": 1398,
  "\" -> Grade \"": 1399,
  "multiply": 1400,
  "subtract": 1401,
  "mult_func": 1402,
  "sub_func": 1403,
  "\"Multiply 10 * 5: \"": 1404,
  "\"Subtract 10 - 5: \"": 1405,
  "is_even": 1406,
  "is_odd": 1407,
  "abs_value": 1408,
  "max_of_two": 1409,
  "\"Is 4 even? \"": 1410,
  "\"Is 7 odd? \"": 1411,
  "\"abs(-15) = \"": 1412,
  "\"max(10, 20) = \"": 1413,
  "sum_array": 1414,
  "find_max": 1415,
  "max_val": 1416,
  "\"Sum: \"": 1417,
  "\"Max: \"": 1418,
  "words": 1419,
  "\"pyrl\"": 1420,
  "nested": 1421,
  "\"Original array: \"": 1422,
  "\"Last element: \"": 1423,
  "\"Array length: \"": 1424,
  "\"After append: \"": 1425,
  "\"orange\"": 1426,
  "\"After insert: \"": 1427,
  "removed": 1428,
  "\"Popped: \"": 1429,
  "\"After pop: \"": 1430,
  "\"\\nIterating over array:\"": 1431,
  "nums": 1432,
  "sorted_nums": 1433,
  "\"Sorted: \"": 1434,
  "sorted_desc": 1435,
  "\"Sorted desc: \"": 1436,
  "reversed_nums": 1437,
  "\"Reversed: \"": 1438,
  "has_five": 1439,
  "\"Contains 5: \"": 1440,
  "workers": 1441,
  "\"Person hash: \"": 1442,
  "country": 1443,
  "\"country\"": 1444,
  "\"Unknown\"": 1445,
  "\"Country: \"": 1446,
  "\"email\"": 1447,
  "\"alice@example.com\"": 1448,
  "\"After adding email: \"": 1449,
  "\"After updating age: \"": 1450,
  "\"Keys: \"": 1451,
  "\"Values: \"": 1452,
  "\"\\nIterating over hash:\"": 1453,
  "\"  \"": 1454,
  "\": \"": 1455,
  "people": 1456,
  "\"\\nPeople array:\"": 1457,
  "\" is \"": 1458,
  "Alice": 1459,
  "Bob": 1460,
  "Charlie": 1461,
  "\"\\nScores:\"": 1462,
  "student_scores": 1463,
  "\" average: \"": 1464,
  "company": 1465,
  "\"Tech Corp\"": 1466,
  "address": 1467,
  "street": 1468,
  "\"123 Main St\"": 1469,
  "\"San Francisco\"": 1470,
  "\"94102\"": 1471,
  "employees": 1472,
  "\"\\nCompany city: \"": 1473,
  "\"address\"": 1474,
  "\"city\"": 1475,
  "word_frequency": 1476,
  "freq": 1477,
  "word": 1478,
  "current": 1479,
  "text_words": 1480,
  "\"the\"": 1481,
  "\"quick\"": 1482,
  "\"brown\"": 1483,
  "\"fox\"": 1484,
  "\"lazy\"": 1485,
  "\"dog\"": 1486,
  "frequency": 1487,
  "\"\\nWord frequency: \"": 1488,
  "group_by_first_letter": 1489,
  "groups": 1490,
  "existing": 1491,
  "animals": 1492,
  "\"Ant\"": 1493,
  "\"Bear\"": 1494,
  "\"Cat\"": 1495,
  "\"Ape\"": 1496,
  "\"Dog\"": 1497,
  "\"Bee\"": 1498,
  "grouped": 1499,
  "\"\\nGrouped animals: \"": 1500,
  "\"=== Simple Function ===\"": 1501,
  "\"=== Function with Parameters ===\"": 1502,
  "greet_person": 1503,
  "\"=== Function with Return ===\"": 1504,
  "\"=== Recursive Function (Factorial) ===\"": 1505,
  "fact5": 1506,
  "\"factorial(5) = \"": 1507,
  "\"=== Functions Demo Complete ===\"": 1508,
  "\"=== Anonymous Function (Simple) ===\"": 1509,
  "\"=== Anonymous Function with Return ===\"": 1510,
  "double": 1511,
  "\"double(21) = \"": 1512,
  "\"=== Anonymous Function with Loop ===\"": 1513,
  "sum_range": 1514,
  "sum_1_to_10": 1515,
  "\"sum_range(1, 10) = \"": 1516,
  "\"=== Anonymous Function with Condition ===\"": 1517,
  "classify": 1518,
  "\"positive\"": 1519,
  "\"negative\"": 1520,
  "\"zero\"": 1521,
  "\"classify(5) = \"": 1522,
  "\"classify(-3) = \"": 1523,
  "\"classify(0) = \"": 1524,
  "\"=== Anonymous Functions Demo Complete ===\"": 1525,
  "Person": 1526,
  "\"Hello, I'm \"": 1527,
  "get_info": 1528,
  "\" years old\"": 1529,
  "\"=== Person Class ===\"": 1530,
  "alice": 1531,
  "bob": 1532,
  "Counter": 1533,
  "increment": 1534,
  "decrement": 1535,
  "reset": 1536,
  "\"=== Counter Class ===\"": 1537,
  "counter": 1538,
  "\"Initial: \"": 1539,
  "\"After increment: \"": 1540,
  "\"After decrement: \"": 1541,
  "\"After reset: \"": 1542,
  "Rectangle": 1543,
  "w": 1544,
  "h": 1545,
  "perimeter": 1546,
  "is_square": 1547,
  "\"=== Rectangle Class ===\"": 1548,
  "rect": 1549,
  "\"Area: \"": 1550,
  "\"Perimeter: \"": 1551,
  "\"Is square: \"": 1552,
  "square": 1553,
  "\"Square area: \"": 1554,
  "Calculator": 1555,
  "initial": 1556,
  "\"=== Calculator Class ===\"": 1557,
  "calc": 1558,
  "\"Add 5: \"": 1559,
  "\"Multiply 2: \"": 1560,
  "\"Subtract 3: \"": 1561,
  "BankAccount": 1562,
  "owner": 1563,
  "\"\"": 1564,
  "balance": 1565,
  "owner_name": 1566,
  "initial_balance": 1567,
  "deposit": 1568,
  "amount": 1569,
  "withdraw": 1570,
  "get_balance": 1571,
  "\"=== BankAccount Class ===\"": 1572,
  "account1": 1573,
  "account2": 1574,
  "\"Alice balance: $\"": 1575,
  "\"Bob balance: $\"": 1576,
  "\"After deposit, Alice: $\"": 1577,
  "\"After withdraw, Alice: $\"": 1578,
  "\"=== Classes Demo Complete ===\"": 1579,
  "\"=== Simple Class ===\"": 1580,
  "\"Hello from \"": 1581,
  "safe_divide": 1582,
  "\"Division by zero!\"": 1583,
  "result1": 1584,
  "\"10 div 2 -> \"": 1585,
  "result2": 1586,
  "\"10 div 0 -> \"": 1587,
  "divide_safely": 1588,
  "\"Division by zero\"": 1589,
  "\"success\"": 1590,
  "\"Result: \"": 1591,
  "\"value\"": 1592,
  "\"Error: \"": 1593,
  "\"error\"": 1594,
  "safe_int": 1595,
  "str_val": 1596,
  "sign": 1597,
  "\"-\"": 1598,
  "valid": 1599,
  "c": 1600,
  "\"0\"": 1601,
  "\"9\"": 1602,
  "\"safe_int('42'): \"": 1603,
  "\"42\"": 1604,
  "\"safe_int('abc'): \"": 1605,
  "\"abc\"": 1606,
  "safe_get": 1607,
  "default": 1608,
  "\"Index 1: \"": 1609,
  "\"Index 10: \"": 1610,
  "\"N/A\"": 1611,
  "safe_hash_get": 1612,
  "\"Email: \"": 1613,
  "\"No email\"": 1614,
  "validate_age": 1615,
  "\"Age cannot be negative\"": 1616,
  "\"Age seems unrealistic\"": 1617,
  "check_age": 1618,
  "\"valid\"": 1619,
  "\"Age \"": 1620,
  "\" is valid\"": 1621,
  "\"Invalid age \"": 1622,
  "validate_input": 1623,
  "errors": 1624,
  "\"Name is required\"": 1625,
  "\"Age must be positive\"": 1626,
  "\"Must be 18 or older\"": 1627,
  "user1": 1628,
  "user2": 1629,
  "validation1": 1630,
  "\"User1 valid: \"": 1631,
  "validation2": 1632,
  "\"User2 valid: \"": 1633,
  "\"errors\"": 1634,
  "\"Errors: \"": 1635,
  "option": 1636,
  "has_value": 1637,
  "unwrap": 1638,
  "opt": 1639,
  "\"has_value\"": 1640,
  "some": 1641,
  "none": 1642,
  "\"Some value: \"": 1643,
  "\"None value: \"": 1644,
  "is_ok": 1645,
  "failure": 1646,
  "parse_number": 1647,
  "\"Cannot parse '\"": 1648,
  "\"' as number\"": 1649,
  "parsed1": 1650,
  "\"123\"": 1651,
  "\"is_ok\"": 1652,
  "\"Parsed: \"": 1653,
  "parsed2": 1654,
  "\"=== TYPE FUNCTIONS ===\"": 1655,
  "\"type(42) = \"": 1656,
  "\"type('hello') = \"": 1657,
  "\"type([1,2,3]) = \"": 1658,
  "\"int('42') = \"": 1659,
  "\"3.14\"": 1660,
  "\"float('3.14') = \"": 1661,
  "\"str(123) = \"": 1662,
  "\"bool(1) = \"": 1663,
  "\"\\n=== MATH FUNCTIONS ===\"": 1664,
  "\"round(3.7) = \"": 1665,
  "3.7": 1666,
  "\"round(3.14159, 2) = \"": 1667,
  "\"min(5, 3, 8, 1) = \"": 1668,
  "\"max(5, 3, 8, 1) = \"": 1669,
  "\"sum([10,20,30,40,50]) = \"": 1670,
  "\"pow(2, 8) = \"": 1671,
  "pow": 1672,
  "\"pow(2, 10) = \"": 1673,
  "\"sqrt(16) = \"": 1674,
  "sqrt": 1675,
  "\"sin(0) = \"": 1676,
  "sin": 1677,
  "\"cos(0) = \"": 1678,
  "cos": 1679,
  "\"floor(3.9) = \"": 1680,
  "floor": 1681,
  "3.9": 1682,
  "\"ceil(3.1) = \"": 1683,
  "ceil": 1684,
  "3.1": 1685,
  "\"\\n=== STRING FUNCTIONS ===\"": 1686,
  "s": 1687,
  "\"Hello World\"": 1688,
  "\"lower('Hello World') = \"": 1689,
  "\"upper('Hello World') = \"": 1690,
  "\"len('Hello World') = \"": 1691,
  "padded": 1692,
  "\"  spaces  \"": 1693,
  "\"strip('  spaces  ') = '\"": 1694,
  "\"'\"": 1695,
  "parts": 1696,
  "\"a,b,c\"": 1697,
  "\",\"": 1698,
  "\"split('a,b,c', ',') = \"": 1699,
  "joined": 1700,
  "\"join('-', parts) = \"": 1701,
  "text": 1702,
  "\"Hello World World\"": 1703,
  "\"find('Hello World World', 'World') = \"": 1704,
  "\"replace('Hello World', 'World', 'Pyrl') = \"": 1705,
  "\"\\n=== ARRAY FUNCTIONS ===\"": 1706,
  "\"len([3,1,4,1,5,9,2,6]) = \"": 1707,
  "\"sorted(array) = \"": 1708,
  "\"reversed(array) = \"": 1709,
  "\"After extend: \"": 1710,
  "\"After insert(0, 0): \"": 1711,
  "\"After remove(0): \"": 1712,
  "popped": 1713,
  "dupes": 1714,
  "\"count([1,2,3,2,2,4], 2) = \"": 1715,
  "\"\\n=== DICT FUNCTIONS ===\"": 1716,
  "\"NYC\"": 1717,
  "\"keys(person) = \"": 1718,
  "\"values(person) = \"": 1719,
  "\"items(person) = \"": 1720,
  "\"get(person, 'name') = \"": 1721,
  "\"get(person, 'email', 'N/A') = \"": 1722,
  "\"\\n=== UTILITY FUNCTIONS ===\"": 1723,
  "range_list": 1724,
  "\"range(5) = \"": 1725,
  "range_step": 1726,
  "\"range(0, 10, 2) = \"": 1727,
  "\"a\"": 1728,
  "\"b\"": 1729,
  "\"c\"": 1730,
  "\"enumerate(['a','b','c']) = \"": 1731,
  "ages": 1732,
  "\"zip(names, ages) = \"": 1733,
  "bools": 1734,
  "\"any([True, True, False]) = \"": 1735,
  "any": 1736,
  "\"all([True, True, False]) = \"": 1737,
  "all": 1738,
  "\"\\n=== RANDOM FUNCTIONS ===\"": 1739,
  "seed": 1740,
  "\"random() = \"": 1741,
  "random": 1742,
  "\"randint(1, 100) = \"": 1743,
  "randint": 1744,
  "choices": 1745,
  "\"rock\"": 1746,
  "\"paper\"": 1747,
  "\"scissors\"": 1748,
  "\"choice(['rock','paper','scissors']) = \"": 1749,
  "choice": 1750,
  "shuffle_test": 1751,
  "shuffle": 1752,
  "\"shuffled = \"": 1753,
  "\"\\n=== CONSTANTS ===\"": 1754,
  "\"PI = \"": 1755,
  "PI": 1756,
  "\"E = \"": 1757,
  "E": 1758,
  "\"True = \"": 1759,
  "\"False = \"": 1760,
  "\"None = \"": 1761,
  "\"=== String Functions ===\"": 1762,
  "\"upper('hello') = \"": 1763,
  "\"WORLD\"": 1764,
  "\"lower('WORLD') = \"": 1765,
  "len_str": 1766,
  "\"len('hello') = \"": 1767,
  "\"=== Math Functions ===\"": 1768,
  "abs_val": 1769,
  "\"abs(-42) = \"": 1770,
  "min_val": 1771,
  "\"min([3,1,4,1,5]) = \"": 1772,
  "\"max([3,1,4,1,5]) = \"": 1773,
  "sum_val": 1774,
  "\"sum([1,2,3,4,5]) = \"": 1775,
  "\"=== Type Conversion ===\"": 1776,
  "\"=== Collection Functions ===\"": 1777,
  "len_arr": 1778,
  "\"=== Builtins Demo Complete ===\"": 1779,
  "bubble_sort": 1780,
  "copy": 1781,
  "swapped": 1782,
  "temp": 1783,
  "unsorted": 1784,
  "\"Bubble sort:\"": 1785,
  "\"  Input: \"": 1786,
  "\"  Output: \"": 1787,
  "selection_sort": 1788,
  "min_idx": 1789,
  "\"Selection sort:\"": 1790,
  "linear_search": 1791,
  "idx": 1792,
  "search_data": 1793,
  "\"Linear search for 30:\"": 1794,
  "\"  Index: \"": 1795,
  "binary_search": 1796,
  "sorted_data": 1797,
  "\"Binary search for 7:\"": 1798,
  "gcd": 1799,
  "\"GCD(48, 18) -> \"": 1800,
  "lcm": 1801,
  "\"LCM(12, 18) -> \"": 1802,
  "is_prime": 1803,
  "\"Prime numbers up to 20:\"": 1804,
  "primes": 1805,
  "is_palindrome": 1806,
  "\"Palindrome check:\"": 1807,
  "\"  'radar': \"": 1808,
  "\"radar\"": 1809,
  "\"  'hello': \"": 1810,
  "char_frequency": 1811,
  "char": 1812,
  "\"Character frequency of 'hello':\"": 1813,
  "\"=== Algorithms Demo Complete ===\"": 1814,
  "\"=== Factorial ===\"": 1815,
  "\"factorial(10) = \"": 1816,
  "\"=== Fibonacci ===\"": 1817,
  "\"fibonacci(10) = \"": 1818,
  "\"fibonacci(15) = \"": 1819,
  "\"=== Is Prime ===\"": 1820,
  "\"is_prime(7) = \"": 1821,
  "\"is_prime(17) = \"": 1822,
  "\"is_prime(20) = \"": 1823,
  "\"=== Sum List ===\"": 1824,
  "sum_list": 1825,
  "\"sum_list([1..10]) = \"": 1826,
  "\"=== GCD ===\"": 1827,
  "\"gcd(48, 18) = \"": 1828,
  "\"gcd(100, 25) = \"": 1829,
  "url": 1830,
  "\"GET \"": 1831,
  "'{\"message\": \"Success\"}'": 1832,
  "http_get_with_headers": 1833,
  "headers": 1834,
  "\"Headers: \"": 1835,
  "'{\"data\": \"response\"}'": 1836,
  "\"POST \"": 1837,
  "\"Body: \"": 1838,
  "'{\"id\": 1, \"created\": true}'": 1839,
  "http_post_json": 1840,
  "json_body": 1841,
  "\"JSON: \"": 1842,
  "'{\"success\": true}'": 1843,
  "handle_webhook": 1844,
  "event_type": 1845,
  "payload": 1846,
  "\"Received webhook: \"": 1847,
  "\"user.created\"": 1848,
  "handle_user_created": 1849,
  "\"user.deleted\"": 1850,
  "handle_user_deleted": 1851,
  "\"order.placed\"": 1852,
  "handle_order_placed": 1853,
  "\"Unknown event type\"": 1854,
  "\"Creating user: \"": 1855,
  "\"User created\"": 1856,
  "\"Deleting user: \"": 1857,
  "\"id\"": 1858,
  "\"User deleted\"": 1859,
  "\"Processing order: \"": 1860,
  "\"order_id\"": 1861,
  "\"Order processed\"": 1862,
  "create_client": 1863,
  "base_url": 1864,
  "\"Content-Type\"": 1865,
  "\"application/json\"": 1866,
  "client_get": 1867,
  "client": 1868,
  "endpoint": 1869,
  "\"base_url\"": 1870,
  "\"headers\"": 1871,
  "client_post": 1872,
  "set_client_header": 1873,
  "\"=== API Client Example ===\"": 1874,
  "\"https://api.example.com\"": 1875,
  "\"Authorization\"": 1876,
  "\"Bearer token123\"": 1877,
  "get_response": 1878,
  "\"/users\"": 1879,
  "\"GET Response: \"": 1880,
  "new_user": 1881,
  "post_response": 1882,
  "\"POST Response: \"": 1883,
  "\"\\n=== Webhook Handler ===\"": 1884,
  "\"charlie@example.com\"": 1885,
  "order_id": 1886,
  "12345": 1887,
  "99.99": 1888,
  "\"=== Running Tests ===\"": 1889,
  "\"Arithmetic\"": 1890,
  "\"Arithmetic tests passed!\"": 1891,
  "\"Comparisons\"": 1892,
  "\"Comparison tests passed!\"": 1893,
  "\"Logical\"": 1894,
  "\"Logical tests passed!\"": 1895,
  "\"String\"": 1896,
  "\"String tests passed!\"": 1897,
  "\"=== All Tests Passed ===\"": 1898,
  "\"=== Perl-style Regex Examples ===\"": 1899,
  "m/World/": 1900,
  "\"Found 'World' in name\"": 1901,
  "\"HELLO\"": 1902,
  "m/hello/i": 1903,
  "\"Case-insensitive match works!\"": 1904,
  "pattern": 1905,
  "\"test123\"": 1906,
  "\"Found 'test' with ~ delimiter\"": 1907,
  "\"user@example.com\"": 1908,
  "m/@/": 1909,
  "\"Email contains @\"": 1910,
  "\"HELLO WORLD\"": 1911,
  "\"Found hello (case-insensitive)\"": 1912,
  "digit_pattern": 1913,
  "qr/\\d+/": 1914,
  "\"123abc\"": 1915,
  "\"Found digits using compiled regex\"": 1916,
  "word_pattern": 1917,
  "qr/hello/im": 1918,
  "\"Compiled pattern created\"": 1919,
  "\"hello world hello\"": 1920,
  "s/hello/hi/": 1921,
  "\"Substitution result: \"": 1922,
  "text2": 1923,
  "\"aaa bbb aaa\"": 1924,
  "s/aaa/xxx/g": 1925,
  "\"Global substitution: \"": 1926,
  "\"/old/path/old\"": 1927,
  "result3": 1928,
  "old": 1929,
  "new": 1930,
  "g": 1931,
  "\"Path substitution: \"": 1932,
  "m/test/": 1933,
  "\"Input contains 'test'\"": 1934,
  "m/\\d/": 1935,
  "\"Input contains digit\"": 1936,
  "ip": 1937,
  "\"192.168.1.1\"": 1938,
  "m/\\d+\\.\\d+\\.\\d+\\.\\d+/": 1939,
  "\"Valid IP format\"": 1940,
  "\"line1\\nline2\"": 1941,
  "m/line2/m": 1942,
  "\"Multiline match works\"": 1943,
  "\"=== Perl-style Regex Demo Complete ===\"": 1944,
  "\"Perl regex m// basic match\"": 1945,
  "\"hello world\"": 1946,
  "m/world/": 1947,
  "\"m// basic match: OK\"": 1948,
  "\"Perl regex m// case-insensitive\"": 1949,
  "\"m//i case-insensitive: OK\"": 1950,
  "\"Perl regex m~ delimiter\"": 1951,
  "\"path/to/file\"": 1952,
  "\"m~~ delimiter: OK\"": 1953,
  "\"Perl regex m// for @ symbol\"": 1954,
  "\"user@domain.com\"": 1955,
  "\"m//@ match: OK\"": 1956,
  "\"Perl regex multiple modifiers\"": 1957,
  "m/WORLD/": 1958,
  "\"Multiple modifiers: OK\"": 1959,
  "\"Perl regex qr// compiled pattern\"": 1960,
  "\"qr// compiled pattern: OK\"": 1961,
  "\"Perl regex qr// with modifiers\"": 1962,
  "qr/hello/i": 1963,
  "\"qr//i with modifiers: OK\"": 1964,
  "\"Perl regex s/// substitution\"": 1965,
  "s/foo/bar/": 1966,
  "\"s/// substitution: OK\"": 1967,
  "\"Perl regex s///g global substitution\"": 1968,
  "\"s///g global: OK\"": 1969,
  "\"Perl regex s~~~ different delimiter\"": 1970,
  "\"s~~~ delimiter: OK\"": 1971,
  "\"Perl regex digit pattern\"": 1972,
  "\"abc123def\"": 1973,
  "m/\\d+/": 1974,
  "\"Digit pattern: OK\"": 1975,
  "\"Perl regex word boundary\"": 1976,
  "\"Word pattern: OK\"": 1977,
  "\"Perl regex IP address pattern\"": 1978,
  "\"IP pattern: OK\"": 1979,
  "\"Perl regex email pattern\"": 1980,
  "\"test@example.com\"": 1981,
  "m/\\w+@\\w+\\.\\w+/": 1982,
  "\"Email pattern: OK\"": 1983,
  "\"=== All Perl Regex Tests Passed ===\"": 1984,
  "3.14": 1985,
  "\"Moscow\"": 1986,
  "\"debug\"": 1987,
  "\"user\"": 1988,
  "\"john@example.com\"": 1989,
  "\"settings\"": 1990,
  "\"theme\"": 1991,
  "\"dark\"": 1992,
  "\"lang\"": 1993,
  "\"ru\"": 1994,
  "\"Handled: \"": 1995,
  "transform": 1996,
  "mapper": 1997,
  "power": 1998,
  "less_eq": 1999,
  "greater_eq": 2000,
  "bang_result": 2001,
  "d": 2002,
  "e": 2003,
  "complex": 2004,
  "logical": 2005,
  "person_name": 2006,
  "person_age": 2007,
  "config_port": 2008,
  "user_name": 2009,
  "theme": 2010,
  "\"adult\"": 2011,
  "\"teenager\"": 2012,
  "\"child\"": 2013,
  "category": 2014,
  "\"senior_active\"": 2015,
  "\"junior_active\"": 2016,
  "\"inactive\"": 2017,
  "iterations": 2018,
  "greet_formal": 2019,
  "title": 2020,
  "\" \"": 2021,
  "classify_number": 2022,
  "get_user_info": 2023,
  "\" (\"": 2024,
  "\")\"": 2025,
  "first_element": 2026,
  "get_key": 2027,
  "my_func": 2028,
  "get_age": 2029,
  "Animal": 2030,
  "speak": 2031,
  "\"...\"": 2032,
  "Dog": 2033,
  "breed": 2034,
  "\"unknown\"": 2035,
  "\"Woof!\"": 2036,
  "fetch": 2037,
  "\" fetches the ball!\"": 2038,
  "divide": 2039,
  "Stack": 2040,
  "push": 2041,
  "peek": 2042,
  "is_empty": 2043,
  "stripped": 2044,
  "\"  hello  \"": 2045,
  "\"x\"": 2046,
  "\"y\"": 2047,
  "\"z\"": 2048,
  "replaced": 2049,
  "\"ll\"": 2050,
  "counted": 2051,
  "\"l\"": 2052,
  "formatted": 2053,
  "\"Name: {}, Age: {}\"": 2054,
  "rounded": 2055,
  "floored": 2056,
  "ceiled": 2057,
  "float_val": 2058,
  "sorted_arr": 2059,
  "reversed_arr": 2060,
  "is_positive": 2061,
  "doubled": 2062,
  "filtered": 2063,
  "sum_all": 2064,
  "is_any": 2065,
  "is_all": 2066,
  "in_range_check": 2067,
  "email_pattern": 2068,
  "r": 2069,
  "\"^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\\.[a-zA-Z]{2,}$\"": 2070,
  "phone_pattern": 2071,
  "\"^\\d{3}-\\d{3}-\\d{4}$\"": 2072,
  "date_pattern": 2073,
  "\"\\d{4}-\\d{2}-\\d{2}\"": 2074,
  "phone": 2075,
  "\"123-456-7890\"": 2076,
  "is_match": 2077,
  "is_not_match": 2078,
  "block_result": 2079,
  "conditional_block": 2080,
  "\"non-positive\"": 2081,
  "loop_block": 2082,
  "\"Basic arithmetic\"": 2083,
  "\"String operations\"": 2084,
  "\"test\"": 2085,
  "\"TEST\"": 2086,
  "\"Array operations\"": 2087,
  "\"Hash operations\"": 2088,
  "\"Function definitions\"": 2089,
  "\"Class instantiation\"": 2090,
  "quick_sort": 2091,
  "reverse_string": 2092,
  "count_chars": 2093,
  "counts": 2094,
  "filter_positive": 2095,
  "double_all": 2096,
  "find_min": 2097,
  "average": 2098,
  "median": 2099,
  "unique": 2100,
  "group_by": 2101,
  "key_func": 2102,
  "app_config": 2103,
  "\"app_name\"": 2104,
  "\"Pyrl Application\"": 2105,
  "\"version\"": 2106,
  "\"1.0.0\"": 2107,
  "\"database\"": 2108,
  "5432": 2109,
  "\"pyrl_db\"": 2110,
  "\"cache\"": 2111,
  "\"enabled\"": 2112,
  "\"ttl\"": 2113,
  "3600": 2114,
  "\"status\"": 2115,
  "\"body\"": 2116,
  "\"GET\"": 2117,
  "\"users\"": 2118,
  "users": 2119,
  "\"/health\"": 2120,
  "\"ok\"": 2121,
  "\"POST\"": 2122,
  "\"created\"": 2123,
  "validate_user": 2124,
  "\"Email is required\"": 2125,
  "\"^[^@]+@[^@]+\\.[^@]+$\"": 2126,
  "\"Invalid email format\"": 2127,
  "paginate": 2128,
  "page": 2129,
  "per_page": 2130,
  "pages": 2131,
  "page_items": 2132,
  "\"items\"": 2133,
  "\"page\"": 2134,
  "\"per_page\"": 2135,
  "\"total\"": 2136,
  "\"pages\"": 2137,
  "Logger": 2138,
  "level": 2139,
  "logs": 2140,
  "\"INFO\"": 2141,
  "log": 2142,
  "entry": 2143,
  "\"level\"": 2144,
  "\"message\"": 2145,
  "\"timestamp\"": 2146,
  "now": 2147,
  "\"[\"": 2148,
  "\"] \"": 2149,
  "info": 2150,
  "warn": 2151,
  "\"WARN\"": 2152,
  "\"ERROR\"": 2153,
  "get_logs": 2154,
  "Application": 2155,
  "routes": 2156,
  "middleware": 2157,
  "route": 2158,
  "use": 2159,
  "\"Application started on port \"": 2160,
  "stop": 2161,
  "\"Application stopped\"": 2162,
  "handle": 2163,
  "\"Not found\"": 2164,
  "home_handler": 2165,
  "\"Welcome to Pyrl App!\"": 2166,
  "users_handler": 2167,
  "products_handler": 2168,
  "\"products\"": 2169,
  "\"Widget\"": 2170,
  "\"price\"": 2171,
  "9.99": 2172,
  "logging_middleware": 2173,
  "req": 2174,
  "\"[LOG] Request received\"": 2175,
  "auth_middleware": 2176,
  "\"[AUTH] Checking authentication\"": 2177,
  "\"/\"": 2178,
  "\"/api/users\"": 2179,
  "\"/api/products\"": 2180,
  "APP_NAME": 2181,
  "\"Pyrl Server\"": 2182,
  "APP_VERSION": 2183,
  "PORT": 2184,
  "env_get": 2185,
  "\"PYRL_PORT\"": 2186,
  "\"8080\"": 2187,
  "id": 2188,
  "\"Item One\"": 2189,
  "\"Item Two\"": 2190,
  "\"Item Three\"": 2191,
  "max_items": 2192,
  "get_all_items": 2193,
  "get_item_by_id": 2194,
  "add_item": 2195,
  "new_id": 2196,
  "new_item": 2197,
  "process_data": 2198,
  "processed": 2199,
  "input_size": 2200,
  "timestamp": 2201,
  "HTML_INDEX": 2202,
  "\"\"\"": 2203,
  "DOCTYPE": 2204,
  "html": 2205,
  "head": 2206,
  "meta": 2207,
  "charset": 2208,
  "\"UTF-8\"": 2209,
  "Pyrl": 2210,
  "App": 2211,
  "style": 2212,
  "font": 2213,
  "family": 2214,
  "Arial": 2215,
  "px": 2216,
  "margin": 2217,
  "auto": 2218,
  "padding": 2219,
  "h1": 2220,
  "color": 2221,
  "code": 2222,
  "background": 2223,
  "pre": 2224,
  "v": 2225,
  "VERSION": 2226,
  "p": 2227,
  "\u0421\u0435\u0440\u0432\u0435\u0440": 2228,
  "\u0440\u0430\u0431\u043e\u0442\u0430\u0435\u0442": 2229,
  "\u0411\u0438\u0437\u043d\u0435\u0441": 2230,
  "\u043b\u043e\u0433\u0438\u043a\u0430": 2231,
  "\u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d\u0430": 2232,
  "\u0432": 2233,
  "pyrl": 2234,
  "h2": 2235,
  "\u0414\u043e\u0441\u0442\u0443\u043f\u043d\u044b\u0435": 2236,
  "\u044d\u043d\u0434\u043f\u043e\u0438\u043d\u0442\u044b": 2237,
  "div": 2238,
  "\"endpoint\"": 2239,
  "GET": 2240,
  "\u042d\u0442\u0430": 2241,
  "\u0441\u0442\u0440\u0430\u043d\u0438\u0446\u0430": 2242,
  "\u0421\u043f\u0438\u0441\u043e\u043a": 2243,
  "\u044d\u043b\u0435\u043c\u0435\u043d\u0442\u043e\u0432": 2244,
  "\u042d\u043b\u0435\u043c\u0435\u043d\u0442": 2245,
  "\u043f\u043e": 2246,
  "ID": 2247,
  "POST": 2248,
  "\u0421\u043e\u0437\u0434\u0430\u0442\u044c": 2249,
  "\u044d\u043b\u0435\u043c\u0435\u043d\u0442": 2250,
  "JSON": 2251,
  "\u041e\u0431\u0440\u0430\u0431\u043e\u0442\u0430\u0442\u044c": 2252,
  "\u0434\u0430\u043d\u043d\u044b\u0435": 2253,
  "\u0421\u0442\u0430\u0442\u0443\u0441": 2254,
  "\u0441\u0435\u0440\u0432\u0435\u0440\u0430": 2255,
  "\u0422\u0435\u0441\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435": 2256,
  "curl": 2257,
  "http": 2258,
  "localhost": 2259,
  "X": 2260,
  "H": 2261,
  "\"Content-Type: application/json\"": 2262,
  "'{\"name\":\"New Item\",\"value\":999}'": 2263,
  "'{\"key\":\"value\",\"count\":42}'": 2264,
  "\"{{APP_NAME}}\"": 2265,
  "\"{{VERSION}}\"": 2266,
  "\"/api/items\"": 2267,
  "startswith": 2268,
  "\"/api/items/\"": 2269,
  "id_str": 2270,
  "\"Unnamed\"": 2271,
  "created": 2272,
  "\"/api/process\"": 2273,
  "\"/api/status\"": 2274,
  "version": 2275,
  "\"running\"": 2276,
  "items_count": 2277,
  "uptime": 2278,
  "\"=\"": 2279,
  "\" v\"": 2280,
  "\"  Port: \"": 2281,
  "\"  Endpoints: /, /api/items, /api/process, /api/status\"": 2282,
  "configure": 2283,
  "quantity": 2284,
  "privilege": 2285,
  "45.95": 2286,
  "90.84": 2287,
  "parent": 2288,
  "percentage": 2289,
  "null": 2290,
  "remainder": 2291,
  "'body'": 2292,
  "\"info\"": 2293,
  "\"sample\"": 2294,
  "radius": 2295,
  "base": 2296,
  "setup": 2297,
  "tokens": 2298,
  "close": 2299,
  "exponent": 2300,
  "schema": 2301,
  "layout": 2302,
  "constraint": 2303,
  "\"password\"": 2304,
  "71.93": 2305,
  "false": 2306,
  "\"start\"": 2307,
  "\"begin\"": 2308,
  "verify": 2309,
  "interval": 2310,
  "swap": 2311,
  "diameter": 2312,
  "enable": 2313,
  "classes": 2314,
  "11.37": 2315,
  "69.74": 2316,
  "chunk": 2317,
  "angle": 2318,
  "speed": 2319,
  "\"group\"": 2320,
  "\"disabled\"": 2321,
  "true": 2322,
  "next_val": 2323,
  "parse": 2324,
  "pos": 2325,
  "schemas": 2326,
  "condition": 2327,
  "force": 2328,
  "38.20": 2329,
  "23.49": 2330,
  "'email'": 2331,
  "segment": 2332,
  "93.38": 2333,
  "'file'": 2334,
  "\"off\"": 2335,
  "'enabled'": 2336,
  "'href'": 2337,
  "child": 2338,
  "block": 2339,
  "flush": 2340,
  "previous": 2341,
  "duration": 2342,
  "role": 2343,
  "denominator": 2344,
  "transactions": 2345,
  "'waiting'": 2346,
  "'source'": 2347,
  "\"source\"": 2348,
  "18.38": 2349,
  "labels": 2350,
  "\"file\"": 2351,
  "calculate": 2352,
  "pool": 2353,
  "'input'": 2354,
  "\"demo\"": 2355,
  "\"type\"": 2356,
  "numerator": 2357,
  "properties": 2358,
  "'world'": 2359,
  "offset": 2360,
  "\"section\"": 2361,
  "\"username\"": 2362,
  "\"data\"": 2363,
  "'disabled'": 2364,
  "display": 2365,
  "\"note\"": 2366,
  "27.57": 2367,
  "\"open\"": 2368,
  "temperature": 2369,
  "'end'": 2370,
  "members": 2371,
  "'result'": 2372,
  "\"code\"": 2373,
  "\"tag\"": 2374,
  "85.76": 2375,
  "17.96": 2376,
  "'text'": 2377,
  "21.77": 2378,
  "77.31": 2379,
  "'left'": 2380,
  "context": 2381,
  "magnitude": 2382,
  "weight": 2383,
  "\"result\"": 2384,
  "80.06": 2385,
  "'done'": 2386,
  "71.38": 2387,
  "val": 2388,
  "toggle": 2389,
  "\"ready\"": 2390,
  "64.87": 2391,
  "'url'": 2392,
  "initialize": 2393,
  "permission": 2394,
  "\"complete\"": 2395,
  "'right'": 2396,
  "\"key\"": 2397,
  "attributes": 2398,
  "\"example\"": 2399,
  "'password'": 2400,
  "batch": 2401,
  "99.43": 2402,
  "\"output\"": 2403,
  "11.29": 2404,
  "\"finish\"": 2405,
  "\"content\"": 2406,
  "tasks": 2407,
  "validation": 2408,
  "validate": 2409,
  "direction": 2410,
  "\"warning\"": 2411,
  "columns": 2412,
  "policy": 2413,
  "chars": 2414,
  "buffer": 2415,
  "outputs": 2416,
  "tail": 2417,
  "alert": 2418,
  "'label'": 2419,
  "\"phone\"": 2420,
  "'message'": 2421,
  "settings": 2422,
  "'open'": 2423,
  "\"chapter\"": 2424,
  "\"token\"": 2425,
  "vector": 2426,
  "56.76": 2427,
  "56.87": 2428,
  "ratio": 2429,
  "\"on\"": 2430,
  "matrix": 2431,
  "32.94": 2432,
  "5.51": 2433,
  "profile": 2434,
  "'title'": 2435,
  "evaluate": 2436,
  "customers": 2437,
  "45.42": 2438,
  "'username'": 2439,
  "'demo'": 2440,
  "bound": 2441,
  "delete": 2442,
  "density": 2443,
  "clean": 2444,
  "94.74": 2445,
  "update": 2446,
  "leaf": 2447,
  "cache": 2448,
  "factor": 2449,
  "\"waiting\"": 2450,
  "velocity": 2451,
  "'tag'": 2452,
  "18.78": 2453,
  "\"false\"": 2454,
  "1.09": 2455,
  "register": 2456,
  "\"pending\"": 2457,
  "'page'": 2458,
  "period": 2459,
  "6.47": 2460,
  "capacity": 2461,
  "59.08": 2462,
  "document": 2463,
  "\"title\"": 2464,
  "70.07": 2465,
  "97.18": 2466,
  "21.15": 2467,
  "11.63": 2468,
  "86.92": 2469,
  "66.96": 2470,
  "45.00": 2471,
  "'close'": 2472,
  "71.13": 2473,
  "output": 2474,
  "\"path\"": 2475,
  "15.83": 2476,
  "93.30": 2477,
  "'token'": 2478,
  "features": 2479,
  "difference": 2480,
  "acceleration": 2481,
  "center": 2482,
  "plan": 2483,
  "load": 2484,
  "22.17": 2485,
  "momentum": 2486,
  "'target'": 2487,
  "'complete'": 2488,
  "merge": 2489,
  "results": 2490,
  "'false'": 2491,
  "59.83": 2492,
  "energy": 2493,
  "40.33": 2494,
  "authenticate": 2495,
  "phase": 2496,
  "'chapter'": 2497,
  "mode": 2498,
  "\"input\"": 2499,
  "responses": 2500,
  "'type'": 2501,
  "'id'": 2502,
  "41.58": 2503,
  "teams": 2504,
  "distance": 2505,
  "'off'": 2506,
  "rule": 2507,
  "read": 2508,
  "mapping": 2509,
